[
    {
        "angular-ui-router": {
            "count": 10171,
            "discription": "\r\n                        UI-Router evolves the concept of an AngularJS Route into a more general concept of a State for managing complex application UI states. Most notably, it allows nested state/view hierarchies and multipl…\r\n                    "
        },
        "switch-statement": {
            "count": 10159,
            "discription": "\r\n                        In computer programming, a switch, case, select or inspect statement is a type of selection control mechanism used to invoke specific blocks of code based on variable contents.\r\n                    "
        },
        "spring-data": {
            "count": 10158,
            "discription": "\r\n                        an umbrella open source project which contains many subprojects that are specific to a given database. The projects are developed by working together with many of the companies and comm…\r\n                    "
        },
        "jersey": {
            "count": 10142,
            "discription": "\r\n                        the open source, production quality, JAX-RS (JSR 311, JSR 339) Reference Implementation for building RESTful Web services.\r\n                    "
        },
        "return": {
            "count": 10109,
            "discription": "\r\n                        A return statement causes execution to leave the current subroutine and resume at the point in the code immediately after where the subroutine was called, known as its return address. The return addre…\r\n                    "
        },
        "ide": {
            "count": 10073,
            "discription": "\r\n                        IDEs (Integrated Development Environment) are computer programs that facilitate efficient software development by providing features beyond those of a simple text editor. \r\n                    "
        },
        "environment-variables": {
            "count": 10058,
            "discription": "\r\n                        a set of dynamic named values that can affect the way running processes will behave on a computer.\r\n                    "
        },
        "amazon-dynamodb": {
            "count": 10042,
            "discription": "\r\n                        a proprietary closed-source cloudnative key-value and document database optimized for horizontal scaling. It's a fully managed, multiregion, multimaster database with built-in secur…\r\n                    "
        },
        "popup": {
            "count": 10029,
            "discription": "\r\n                        In general, popup refers to any UI element that floats above a window or application surface. This may include tooltips, context menus, and modal dialog windows.\r\n                    "
        },
        "subprocess": {
            "count": 10015,
            "discription": "\r\n                        The Python subprocess module allows you to spawn new processes, connect to their input/output/error pipes, and obtain their return codes. Use it to run a shell command or an executable in Python.\r\n                    "
        },
        "boolean": {
            "count": 9980,
            "discription": "\r\n                        a data type with only two possible values: true or false.\r\n                    "
        },
        "stack": {
            "count": 9973,
            "discription": "\r\n                        a last in, first out (LIFO) abstract data type and data structure. For questions about the call stack, use [callstack] or [stack-pointer] instead. For questions about the Haskell build tool…\r\n                    "
        },
        "widget": {
            "count": 9969,
            "discription": "\r\n                        an element of a user interface (GUI widget) or a self-contained (usually small) software application (desktop widget).\r\n\r\nIn computing , an application, or a component of an interface, tha…\r\n                    "
        },
        "foreign-keys": {
            "count": 9952,
            "discription": "\r\n                        a data integrity feature of relational (and SQL) databases. A foreign key is a set of attributes in a relational table that is subject to a referential integrity constraint. The refer…\r\n                    "
        },
        "user-controls": {
            "count": 9937,
            "discription": "\r\n                        a separate, reusable input control that allows a user to interact with an application. User controls can be buttons, checkboxes, input text boxes, mice, keyboards, etc.\r\n                    "
        },
        "copy": {
            "count": 9927,
            "discription": "\r\n                        to create a duplicate of an object without destroying the original. Commonly seen in text editors that will let you copy some text and paste it somewhere else.\r\n                    "
        },
        "pytorch": {
            "count": 9925,
            "discription": "\r\n                        a deep learning framework that implements a dynamic computational graph, which allows you to change the way your neural network behaves on the fly and capable of performing backward automat…\r\n                    "
        },
        "find": {
            "count": 9916,
            "discription": "\r\n                        has multiple meanings.  Please DO NOT use this tag if you're just trying to find something.\r\n                    "
        },
        "google-play": {
            "count": 9915,
            "discription": "\r\n                        an integrated destination for apps, books, movies, games, and music, accessible to users on Android devices and to anyone on the Web. (Note: Support questions regarding the Google Play …\r\n                    "
        },
        "gps": {
            "count": 9915,
            "discription": "\r\n                        Abbreviation for Global Positioning System; a navigational system using satellite signals to fix the location of a radio receiver on or above the earth's surface. Also \"GPS\" refers to the radio receiv…\r\n                    "
        },
        "int": {
            "count": 9895,
            "discription": "\r\n                        A data type that represents an integer. An integer is a whole number that can be negative, positive, or zero. (i.e. ...-2, -1, 0, 1, 2...) Use this tag for questions about using, storing, or manipulat…\r\n                    "
        },
        "firebase-cloud-messaging": {
            "count": 9853,
            "discription": "\r\n                        the new version of GCM. It inherits the reliable and scalable GCM infrastructure, plus new features. It is a cross-platform solution that let user reliably deliver an…\r\n                    "
        },
        "nuget": {
            "count": 9843,
            "discription": "\r\n                        a free, open source developer focused package management system for the .NET platform.\r\n                    "
        },
        "gdb": {
            "count": 9830,
            "discription": "\r\n                        for problems related to or involving GDB, the standard debugger for the GNU software system.\r\n                    "
        },
        "powerbi": {
            "count": 9825,
            "discription": "\r\n                        a free, self-service analytics tool available individually or integrated with Microsoft Excel, Office 365 and all major Databases and analytics tools.  \r\n                    "
        },
        "mono": {
            "count": 9811,
            "discription": "\r\n                        an open source implementation of .NET that runs on many platforms, including Linux, Mac OS X, and Windows.  This allows running .NET applications on platforms other than Windows with little to…\r\n                    "
        },
        "drupal-7": {
            "count": 9807,
            "discription": "\r\n                        the Drupal version that was officially released on January 5, 2011. Rather than using this tag, consider posting your question directly on https://drupal.stackexchange.com/.\r\n                    "
        },
        "passwords": {
            "count": 9794,
            "discription": "\r\n                        primarily used as a way of accessing information and also limiting the number of users who can get access to a machine. It is primarily used with a username for the authorization system.…\r\n                    "
        },
        "selenium-chromedriver": {
            "count": 9780,
            "discription": "\r\n                        Developed in collaboration with the Chromium team, ChromeDriver is a standalone server which implements WebDriver's wire protocol.\r\n                    "
        },
        "qml": {
            "count": 9745,
            "discription": "\r\n                        a declarative language that allows user\r\ninterfaces to be described in terms of their visual components and how\r\nthey interact and relate with one another. It is a highly…\r\n                    "
        },
        "coffeescript": {
            "count": 9734,
            "discription": "\r\n                        a language that compiles into JavaScript. Underneath all of those embarrassing braces and semicolons, JavaScript has always had a gorgeous object model at its heart. CoffeeScript is an…\r\n                    "
        },
        "kivy": {
            "count": 9733,
            "discription": "\r\n                        an open source Python library for rapid development of cross-platform applications equipped with novel user interfaces, such as multi-touch apps.\r\n                    "
        },
        "twig": {
            "count": 9729,
            "discription": "\r\n                        a modern, fast, flexible, and secure templating engine for PHP. Created for Symfony and adopted by Drupal 8.\r\n                    "
        },
        "yaml": {
            "count": 9724,
            "discription": "\r\n                        for questions about the YAML data serialization format only, not for questions about programs (or examples) that happen to have their configuration in a YAML format. Questions about the C…\r\n                    "
        },
        "synchronization": {
            "count": 9705,
            "discription": "\r\n                        Synchronization refers to using controls to maintain a coherent representation, either a group of processes running the same program (process synchronization), or representations of data (data synchro…\r\n                    "
        },
        "composer-php": {
            "count": 9700,
            "discription": "\r\n                        an application-level package manager for the PHP programming language. It provides a standard format for managing with ease PHP-based project dependencies (libraries) and was strongly insp…\r\n                    "
        }
    }
]