{
    "javascript": {
        "count": 2135711,
        "discription": "\r\n                        For questions regarding programming in ECMAScript (JavaScript/JS) and its various dialects/implementations (excluding ActionScript). Please include all relevant tags on your question; e.g., [node.js],…\r\n                    "
    },
    "java": {
        "count": 1738075,
        "discription": "\r\n                        a popular high-level programming language. Use this tag when you're having problems using or understanding the language itself. This tag is rarely used alone and is most often used in conjunct…\r\n                    "
    },
    "python": {
        "count": 1605008,
        "discription": "\r\n                        a multi-paradigm, dynamically typed, multipurpose programming language. It is designed to be quick to learn, understand, and use, and enforce a clean and uniform syntax. Please note that Pyt…\r\n                    "
    },
    "c#": {
        "count": 1452557,
        "discription": "\r\n                        a high level, statically typed, multi-paradigm programming language developed by Microsoft. C# code usually targets Microsoft's .NET family of tools and run-times, which…\r\n                    "
    },
    "php": {
        "count": 1383046,
        "discription": "\r\n                        a widely used, high-level, dynamic, object-oriented, and interpreted scripting language primarily designed for server-side web development. Used for questions about the PHP language.\r\n                    "
    },
    "android": {
        "count": 1313412,
        "discription": "\r\n                        Google's mobile operating system, used for programming or developing digital devices (Smartphones, Tablets, Automobiles, TVs, Wear, Glass, IoT). For topics related to Android, use Android-s…\r\n                    "
    },
    "html": {
        "count": 1040332,
        "discription": "\r\n                        the markup language for creating web pages and other information to be displayed in a web browser. Questions regarding HTML should include a minimal reproducible ex…\r\n                    "
    },
    "jquery": {
        "count": 1003213,
        "discription": "\r\n                        a JavaScript library, consider also adding the JavaScript tag. \r\n\r\njQuery is a popular cross-browser JavaScript library that facilitates Document Object Model (DOM) traversal, event handling…\r\n                    "
    },
    "c++": {
        "count": 704350,
        "discription": "\r\n                        a general-purpose programming language. It was originally designed as an extension to C and has a similar syntax, but it is now a completely different language. Use this tag for questions about…\r\n                    "
    },
    "css": {
        "count": 696270,
        "discription": "\r\n                        a representation style sheet language used for describing the look and formatting of HTML (HyperText Markup Language), XML (Extensible Markup Language) documents and SV…\r\n                    "
    },
    "ios": {
        "count": 646464,
        "discription": "\r\n                        the mobile operating system running on the Apple iPhone, iPod touch, and iPad. Use this tag [ios] for questions related to programming on the iOS platform. Use the related tags [objective-c] an…\r\n                    "
    },
    "mysql": {
        "count": 613842,
        "discription": "\r\n                        a free, open source Relational Database Management System (RDBMS) that uses Structured Query Language (SQL).  DO NOT USE this tag for other DBs such as SQL Server, SQLite etc.  Those are diff…\r\n                    "
    },
    "sql": {
        "count": 571638,
        "discription": "\r\n                        a language for querying databases. Questions should include code examples, table structure, sample data, and a tag for the DBMS implementation (e.g. MySQL, PostgreSQ…\r\n                    "
    },
    "r": {
        "count": 379193,
        "discription": "\r\n                        a free, open-source programming language and software environment for statistical computing, bioinformatics, visualization, and general computing. Please provide minimal and reproducible example(…\r\n                    "
    },
    "node.js": {
        "count": 363450,
        "discription": "\r\n                        an event-based, non-blocking, asynchronous I/O runtime that uses Google's V8 JavaScript engine and libuv library. It is used for developing applications that make heavy use of the ability t…\r\n                    "
    },
    "asp.net": {
        "count": 360657,
        "discription": "\r\n                        a Microsoft web application development framework that allows programmers to build dynamic web sites, web applications and web services. It is useful to use this tag in conjunction with the…\r\n                    "
    },
    "arrays": {
        "count": 350139,
        "discription": "\r\n                        an ordered linear data structure consisting of a collection of elements (values, variables or references), each identified by one or more indexes. When asking about specific variants of ar…\r\n                    "
    },
    "c": {
        "count": 346772,
        "discription": "\r\n                        a general-purpose programming language used for system programming (OS and embedded), libraries, games and cross-platform. This tag should be used with general questions concerning the C language…\r\n                    "
    },
    "ruby-on-rails": {
        "count": 322562,
        "discription": "\r\n                        an open source full-stack web application framework written in Ruby. It follows the popular MVC framework model and is known for its \"convention over configuration\" approach to applic…\r\n                    "
    },
    "json": {
        "count": 307550,
        "discription": "\r\n                        a serializable data interchange format intended to be machine and human readable. Do not use this tag for native JavaScript objects or JavaScript object literals. …\r\n                    "
    },
    ".net": {
        "count": 303626,
        "discription": "\r\n                        Do NOT use for questions about .NET Core - use [.net-core] instead. The .NET framework is a software framework designed mainly for the Microsoft Windows operating system. It includes an implementation…\r\n                    "
    },
    "sql-server": {
        "count": 296730,
        "discription": "\r\n                        a relational database management system (RDBMS). Use this tag for all SQL Server editions including Compact, Express, Azure, Fast-track, APS (formerly PDW) and Azure SQL DW. Do…\r\n                    "
    },
    "objective-c": {
        "count": 291060,
        "discription": "\r\n                        should be used only on questions that are about Objective-C features or depend on code in the language. The tags [cocoa] and [cocoa-touch] should be used to ask about Apple's frameworks or cl…\r\n                    "
    },
    "swift": {
        "count": 284510,
        "discription": "\r\n                        a safe, fast, and expressive general-purpose programming language developed by Apple Inc. for its platforms and Linux. Swift is open-source. Use the tag only for questions about language feat…\r\n                    "
    },
    "reactjs": {
        "count": 267108,
        "discription": "\r\n                        a JavaScript library for building user interfaces. It uses a declarative, component-based paradigm and aims to be both efficient and flexible.\r\n                    "
    },
    "python-3.x": {
        "count": 264326,
        "discription": "\r\n                        For questions about Python programming that are specific to version 3+ of the language. Use the more generic [python] tag on all Python questions, and only add this one if your question is version-spe…\r\n                    "
    },
    "angularjs": {
        "count": 261811,
        "discription": "\r\n                        Use for questions about AngularJS (1.x), the open-source JavaScript framework. Do NOT use this tag for Angular 2 or later versions; instead, use the [angular] tag.\r\n                    "
    },
    "django": {
        "count": 252866,
        "discription": "\r\n                        an open-source server-side web application framework, written in Python. It is designed to reduce the effort required to create complex data-driven websites and web applications, with a spec…\r\n                    "
    },
    "angular": {
        "count": 240011,
        "discription": "\r\n                        Questions about Angular (not to be confused with AngularJS), the web framework from Google. Use this tag for Angular questions which are not specific to an individual version. For the older AngularJS …\r\n                    "
    },
    "excel": {
        "count": 238129,
        "discription": "\r\n                        Only for questions on programming against Excel objects or files, or complex formula development. You may combine the Excel tag with VBA, VSTO, C#, VB.NET, PowerShell, OLE automation, and other progra…\r\n                    "
    },
    "regex": {
        "count": 235509,
        "discription": "\r\n                        Regular expressions provide a declarative language to match patterns within strings. They are commonly used for string validation, parsing, and transformation. Because regular expressions are not full…\r\n                    "
    },
    "iphone": {
        "count": 220845,
        "discription": "\r\n                        unless you are addressing Apple's iPhone and/or iPod touch specifically. For questions not dependent on hardware, use the tag [ios]. More tags to consider are [xcode] (but only if …\r\n                    "
    },
    "ruby": {
        "count": 216893,
        "discription": "\r\n                        a multi-platform open-source, dynamic object-oriented interpreted language, created by Yukihiro Matsumoto (Matz) in 1995. The [ruby] tag is for questions related to the Ruby language, includin…\r\n                    "
    },
    "ajax": {
        "count": 213269,
        "discription": "\r\n                        a technique for creating interactive website user interfaces without the traditional web page refresh or reload. It uses asynchronous data exchange between cl…\r\n                    "
    },
    "linux": {
        "count": 198859,
        "discription": "\r\n                        LINUX QUESTIONS MUST BE PROGRAMMING RELATED.\r\n\r\nUse this tag only if your question relates to programming using Linux APIs or Linux-specific behavior, not just because you happen to run your code on L…\r\n                    "
    },
    "xml": {
        "count": 198649,
        "discription": "\r\n                        is used with questions about the use of the Extensible Markup Language (XML), a structured document format defining text encoding rules. When using this tag include additional tags such as…\r\n                    "
    },
    "asp.net-mvc": {
        "count": 192859,
        "discription": "\r\n                        an open source web application framework and tooling that implements a version of the model-view-controller (MVC) pattern tailored towards web applications and built upon …\r\n                    "
    },
    "vba": {
        "count": 182863,
        "discription": "\r\n                        an event-driven, object-oriented programming language for writing macros, used for the entire Office suite as well as other applications. VBA is not equivalent t…\r\n                    "
    },
    "pandas": {
        "count": 181580,
        "discription": "\r\n                        a Python library for data manipulation and analysis, e.g. dataframes, multidimensional time series and cross-sectional datasets commonly found in statistics, experimental science results, ec…\r\n                    "
    },
    "spring": {
        "count": 178851,
        "discription": "\r\n                        an open source framework for application development on the Java platform. At its core is rich support for component-based architectures, and it currently has over twenty highl…\r\n                    "
    },
    "database": {
        "count": 174165,
        "discription": "\r\n                        an organized collection of data. It is the collection of schemas, tables, queries, reports, views, and other objects. The data are typically organized to model aspects of reality in a wa…\r\n                    "
    },
    "wordpress": {
        "count": 171197,
        "discription": "\r\n                        for programming-specific questions about the WordPress content management system. Off-topic questions include those about theme development, WordPress administration, management best pract…\r\n                    "
    },
    "laravel": {
        "count": 163163,
        "discription": "\r\n                        a free, open-source PHP web framework, created by Taylor Otwell and intended for the development of web applications following the model–view–controller (MVC) architectural pattern and base…\r\n                    "
    },
    "string": {
        "count": 160240,
        "discription": "\r\n                        a finite sequence of symbols, commonly used for text, though sometimes for arbitrary data.\r\n                    "
    },
    "wpf": {
        "count": 159772,
        "discription": "\r\n                        a subsystem for rendering user interfaces in Windows-based applications.\r\n                    "
    },
    "xcode": {
        "count": 147185,
        "discription": "\r\n                        Apple's integrated development environment (IDE). USAGE NOTE: Use this tag only for questions about the Xcode IDE itself, and not for general Mac or iOS programming topics. Use [cocoa] for Ma…\r\n                    "
    },
    "windows": {
        "count": 146325,
        "discription": "\r\n                        Writing software specific to the Microsoft Windows operating system: APIs, behaviors, etc. Note: GENERAL WINDOWS SUPPORT IS OFF-TOPIC. Support questions may be asked on https://superuser.com\r\n                    "
    },
    "mongodb": {
        "count": 140833,
        "discription": "\r\n                        a scalable, high-performance, open source, document-oriented NoSQL database. It supports a large number of languages and application development platforms. Questions about server administra…\r\n                    "
    },
    "typescript": {
        "count": 134648,
        "discription": "\r\n                        a typed superset of JavaScript that compiles to plain JavaScript. It adds optional types, classes, interfaces, and modules to JavaScript. This tag is for questions specific to TypeScript…\r\n                    "
    },
    "vb.net": {
        "count": 132457,
        "discription": "\r\n                        a multi-paradigm, managed, type-safe, object-oriented computer programming language. Along with C# and F#, it is one of the main languages targeting the .NET Framework. VB…\r\n                    "
    },
    "bash": {
        "count": 131231,
        "discription": "\r\n                        For questions about scripts written for the Bash command shell.  For shell scripts with errors/syntax errors, please check them with the shellcheck program (or in the web shellcheck server at https://…\r\n                    "
    },
    "oracle": {
        "count": 129243,
        "discription": "\r\n                        a Multi-Model Database Management System created by Oracle Corporation. Do NOT use this tag for other products owned by Oracle, such as Java and MySQL.\r\n                    "
    },
    "postgresql": {
        "count": 128987,
        "discription": "\r\n                        an open-source, object-relational database management system (ORDBMS) available for all major platforms including Linux, UNIX, Windows and OS X.  \r\nPlease mention your exact version of P…\r\n                    "
    },
    "git": {
        "count": 128942,
        "discription": "\r\n                        an open-source distributed version control system (DVCS). Use this tag for questions related to Git usage and workflows. DO NOT USE the [github] tag for Git-related issues simply because a repo…\r\n                    "
    },
    "multithreading": {
        "count": 126925,
        "discription": "\r\n                        For questions regarding multi-threading, the ability of a computer or a program to perform work concurrently or asynchronously by utilizing multiple concurrent streams of execution (generally referred…\r\n                    "
    },
    "eclipse": {
        "count": 121299,
        "discription": "\r\n                        an open source IDE and platform for building applications. There is a wide variety of plugins for various programming languages and other development-oriented tools (such as modeling, datab…\r\n                    "
    },
    "list": {
        "count": 110408,
        "discription": "\r\n                        may refer to: a linked list (an ordered set of nodes, each referencing its successor), or a form of dynamic array. Not to be used for HTML lists, use [html-lists] instead.\r\n                    "
    },
    "amazon-web-services": {
        "count": 107657,
        "discription": "\r\n                        a public-cloud: IaaS (Infrastructure as a Service) and SaaS (Software as a Service) provided by Amazon. Questions about programming and architecture are on topic. General …\r\n                    "
    },
    "algorithm": {
        "count": 104676,
        "discription": "\r\n                        a sequence of well-defined steps that defines an abstract solution to a problem. Use this tag when your issue is related to algorithm design.\r\n                    "
    },
    "forms": {
        "count": 104611,
        "discription": "\r\n                        essentially a container that can be used to hold any amount of any subset of several types of data. HTML forms are used to pass data to a server. VB and C# forms are the windows used to inte…\r\n                    "
    },
    "macos": {
        "count": 104213,
        "discription": "\r\n                        macOS (formerly known as OS X or Mac OS X) is the desktop operating system from Apple, found on Macintosh computers.\r\n\r\nUse this tag only if your question relates to using macOS APIs or macOS-specific…\r\n                    "
    },
    "firebase": {
        "count": 103823,
        "discription": "\r\n                        a serverless platform for unified development of applications for mobile devices and for the web. It uses a NoSQL structure as opposed to RDBMS.\r\n                    "
    },
    "image": {
        "count": 103117,
        "discription": "\r\n                        is for questions related to the loading, formatting, saving, compression, and display of images in the context of source code. This tag should also be used for assistance using various i…\r\n                    "
    },
    "scala": {
        "count": 101874,
        "discription": "\r\n                        a general-purpose programming language principally targeting the Java Virtual Machine. Designed to express common programming patterns in a concise, elegant, and type-safe way, it fuses both …\r\n                    "
    },
    "twitter-bootstrap": {
        "count": 99982,
        "discription": "\r\n                        a front-end framework designed to kick-start development of Web apps and sites. For questions related to a version of Bootstrap also use the specific version's tag from \"twitter-bootstrap…\r\n                    "
    },
    "visual-studio": {
        "count": 99904,
        "discription": "\r\n                        if you have a specific question about Visual Studio features and functionality. DO NOT use this tag on questions regarding code which merely happened to be written in Visual Studio.  Cons…\r\n                    "
    },
    "azure": {
        "count": 97427,
        "discription": "\r\n                        a Platform as a Service and Infrastructure as a Service cloud computing platform. Use this tag for programming questions concerning Azure. General server help can be obtained at Sup…\r\n                    "
    },
    "spring-boot": {
        "count": 95973,
        "discription": "\r\n                        a framework that allows to easily create Spring-powered, production-grade applications and services with the absolute minimum fuss. It takes an opinionated view of the Spring platform d…\r\n                    "
    },
    "python-2.7": {
        "count": 94253,
        "discription": "\r\n                        the last major version in the 2.x series, and is no longer maintained since January 1st 2020. Use the generic [python] tag on all Python questions. Do not add this tag simply to convey t…\r\n                    "
    },
    "performance": {
        "count": 91251,
        "discription": "\r\n                        For questions pertaining to the measurement or improvement of code and application efficiency.\r\n                    "
    },
    "winforms": {
        "count": 90992,
        "discription": "\r\n                        the informal name given to Windows Forms, a GUI class library in the Microsoft .NET Framework and Mono. Questions in this tag should also be tagged with the target framework ([.net] or [mo…\r\n                    "
    },
    "function": {
        "count": 90063,
        "discription": "\r\n                        A function (also called a procedure, method, subroutine, or routine) is a portion of code intended to carry out a single, specific task. Use this tag for questions which specifically involve creating …\r\n                    "
    },
    "react-native": {
        "count": 90042,
        "discription": "\r\n                        a JavaScript library used to build native mobile apps using React. The focus of React Native is on developer efficiency across all the platforms you care about - learn once, write anyw…\r\n                    "
    },
    "matlab": {
        "count": 89500,
        "discription": "\r\n                        a high-level language and interactive programming environment for numerical computation and visualization developed by MathWorks. Don’t use both the [matlab] and [octave] tags, unless the qu…\r\n                    "
    },
    "docker": {
        "count": 88859,
        "discription": "\r\n                        a tool to build and run containers. Questions concerning Dockerfiles, operations, and architecture are accepted. Questions about running docker in production may find better responses on \r\nS…\r\n                    "
    },
    "apache": {
        "count": 88417,
        "discription": "\r\n                        (along with an appropriate programming-language tag) for programming questions relating to the Apache HTTP Server. Do not use this tag for questions about other Apache Foundation products…\r\n                    "
    },
    "powershell": {
        "count": 87486,
        "discription": "\r\n                        a cross-platform command line and scripting utility from Microsoft. Use this tag for questions about writing and executing PowerShell scripts ONLY. Programming questions specific to the …\r\n                    "
    },
    "api": {
        "count": 85938,
        "discription": "\r\n                        ALONE. Tagging with the library like [api-design] or a specific tag like [google-api] is preferred,  where applicable. Questions asking to recommend or find an API are off-topic.\r\n                    "
    },
    "entity-framework": {
        "count": 85917,
        "discription": "\r\n                        a LINQ-based object-database mapper for .NET. It supports change tracking, updates, and schema migrations for many databases. Please add a version-specific tag, when applicable.\r\n                    "
    },
    "sqlite": {
        "count": 85908,
        "discription": "\r\n                        a software library that implements a self-contained, serverless, zero-configuration, transactional SQL database engine.\r\n                    "
    },
    "hibernate": {
        "count": 85821,
        "discription": "\r\n                        an object-relational mapping (ORM) library for the Java language enabling developers to utilize POJO-style domain models in their applications in ways extending well beyond Object/Relatio…\r\n                    "
    },
    "facebook": {
        "count": 84972,
        "discription": "\r\n                        Facebook Platform lets developers integrate their apps directly into the Facebook social networking service. Use this tag for questions which may arise when developing FOR Facebook. This tag is NOT fo…\r\n                    "
    },
    "numpy": {
        "count": 83845,
        "discription": "\r\n                        an extension of the Python language that adds support to large multidimensional arrays and matrixes, along with a large library of high-level mathematical functions for operations with these …\r\n                    "
    },
    "dataframe": {
        "count": 83815,
        "discription": "\r\n                        a tabular data structure. Usually, it contains data where rows are observations and columns are variables of various types. While \"data frame\" or \"dataframe\" is the term used for this …\r\n                    "
    },
    "selenium": {
        "count": 81610,
        "discription": "\r\n                        a popular open-source tool for automating web browsers. When using this tag, also include other tags for the specific components you are using, e.g. selenium-webdriver for the language bin…\r\n                    "
    },
    "rest": {
        "count": 81142,
        "discription": "\r\n                        a style of software architecture for distributed hypermedia systems such as the World Wide Web. It has increased in popularity relative to RPC architectures s…\r\n                    "
    },
    "shell": {
        "count": 80470,
        "discription": "\r\n                        The term 'shell' refers to a general class of text-based interactive command interpreters most often associated with the Unix & Linux operating systems.  For questions about shell scripting, please us…\r\n                    "
    },
    "linq": {
        "count": 80242,
        "discription": "\r\n                        a Microsoft .NET Framework component that adds native data querying capabilities to .NET languages. Please consider using more detailed tags when appropriate, for e…\r\n                    "
    },
    "loops": {
        "count": 77786,
        "discription": "\r\n                        a type of control flow structure in programming in which a series of statements may be executed repeatedly until some condition is met.\r\n                    "
    },
    "qt": {
        "count": 77769,
        "discription": "\r\n                        a cross-platform application development framework widely used for the development of application software that can be run on various software and hardware platforms with little or no change in …\r\n                    "
    },
    "swing": {
        "count": 77225,
        "discription": "\r\n                        the primary user-interface toolkit in Java and is shipped with the standard Java SDK. It is contained within the package javax.swing.\r\n                    "
    },
    "maven": {
        "count": 77062,
        "discription": "\r\n                        a build automation and project management tool used primarily for Java projects. This tag is for questions that don't relate to a specific Maven version. Use the gradle tag instead for…\r\n                    "
    },
    "csv": {
        "count": 74359,
        "discription": "\r\n                        Comma-Separated Values or Character-Separated Values (CSV) is a standard \"flat file database\" format for storing tabular data in plain text, consisting of an optional header row that lists the table f…\r\n                    "
    },
    "android-studio": {
        "count": 74153,
        "discription": "\r\n                        Use for questions about using Android Studio, an official IDE by Google targeted at Android app development. Do NOT use for questions about programming for Android in general; instead, use the [androi…\r\n                    "
    },
    "unit-testing": {
        "count": 73055,
        "discription": "\r\n                        a method by which individual units of source code are tested to determine if they are fit for use.\r\n\r\n                    "
    },
    "file": {
        "count": 72620,
        "discription": "\r\n                        A block of arbitrary information, or resource for storing information, accessible by the string-based name or path. Files are available to computer programs and are usually based on some kind of persi…\r\n                    "
    },
    "express": {
        "count": 71626,
        "discription": "\r\n                        a minimal and flexible Node.js web application framework providing a robust set of features for building web applications.\r\n                    "
    },
    "flutter": {
        "count": 69901,
        "discription": "\r\n                        an open-source UI software development kit created by Google. It is used to develop applications for Android, iOS, Linux, Mac, Windows, Google Fuchsia and the web from a single codebase.\r\n                    "
    },
    "vue.js": {
        "count": 69787,
        "discription": "\r\n                        an open-source, progressive Javascript framework for building user interfaces that aim to be incrementally adoptable. Vue.js is mainly used for front-end development and requires an intermed…\r\n                    "
    },
    ".htaccess": {
        "count": 69022,
        "discription": "\r\n                        Directory-level configuration file used by Apache web servers. Use this tag if and only if .htaccess content is directly involved in the topic. We know many people are using .htaccess, but kindly ask …\r\n                    "
    },
    "class": {
        "count": 68811,
        "discription": "\r\n                        A template for creating new objects that describes the common state(s) and behavior(s). NOT TO BE CONFUSED WITH CSS CLASSES. Use [css] instead.\r\n                    "
    },
    "codeigniter": {
        "count": 67614,
        "discription": "\r\n                        an open-source PHP web development framework created by EllisLab Inc and it has been adopted by the British Columbia Institute of Technology. The framework implements a modified version…\r\n                    "
    },
    "symfony": {
        "count": 67584,
        "discription": "\r\n                        Symfony refers to both a PHP framework for building web applications as well as a set of components on which the framework is built.\r\n\r\nThis tag refers to the currently supported major versions 2.x, 3…\r\n                    "
    },
    "perl": {
        "count": 66009,
        "discription": "\r\n                        a procedural, high-level, general-purpose, dynamic programming language, known for its native support of regular expressions and string parsing capabilities. Please use this tag for questions …\r\n                    "
    },
    "google-chrome": {
        "count": 65512,
        "discription": "\r\n                        for questions related to development with Google Chrome, a web browser that uses the Blink rendering engine.  Warning! General support for the browser is off-topic: questions about …\r\n                    "
    },
    "sorting": {
        "count": 65442,
        "discription": "\r\n                        the process of applying some order to a collection of items.\r\n                    "
    },
    "date": {
        "count": 65404,
        "discription": "\r\n                        a reference to a particular day represented within a calendar system, and consists of year, month and day.\r\n                    "
    },
    "tensorflow": {
        "count": 64930,
        "discription": "\r\n                        an open-source library and API designed for deep learning, written and maintained by Google. Use this tag with a language-specific tag ([python], [c++], [javascript], [r], etc.) for ques…\r\n                    "
    },
    "apache-spark": {
        "count": 64929,
        "discription": "\r\n                        an open source distributed data processing engine written in Scala providing a unified API and distributed data sets to users for both batch and streaming processing. Use Cases for Apa…\r\n                    "
    },
    "tsql": {
        "count": 64738,
        "discription": "\r\n                        T-SQL (Transact Structured Query Language) is the extension of SQL functionality supported by Sybase ASE and Microsoft SQL Server. Do not use this tag for MySQL, PostgreSql, Oracle(Pl/SQL) related que…\r\n                    "
    },
    "google-maps": {
        "count": 63578,
        "discription": "\r\n                        a desktop and mobile web mapping service application and technology provided by Google, offering satellite imagery, street maps, and Street View perspectives. Also supported are maps em…\r\n                    "
    },
    "uitableview": {
        "count": 62802,
        "discription": "\r\n                        a class used for displaying and editing lists of information on iOS. A table view displays items in a single column. UITableView is a subclass of UIScrollView, which allows users to scr…\r\n                    "
    },
    "validation": {
        "count": 61359,
        "discription": "\r\n                        used to check data to make sure it fits whatever required specifications are set for it.  Typically Validation is used in checking input data, and in verifying data before storage.\r\n                    "
    },
    "cordova": {
        "count": 61053,
        "discription": "\r\n                        a framework that allows developers to create cross-platform mobile applications using web technologies like HTML, JavaScript, and CSS.\r\n                    "
    },
    "sockets": {
        "count": 60925,
        "discription": "\r\n                        An endpoint of a bi-directional inter-process communication flow. This often refers to a process flow over a network connection, but by no means is limited to such. Not to be confused with WebSocket (…\r\n                    "
    },
    "opencv": {
        "count": 60795,
        "discription": "\r\n                        a library for real time computer vision. When using this tag, please mention the OpenCV release you're working with (e.g. 3.4.6), and add a language specific ta…\r\n                    "
    },
    "http": {
        "count": 60187,
        "discription": "\r\n                        an application level network protocol that is used for the transfer of content on the World Wide Web.\r\n                    "
    },
    "web-services": {
        "count": 60020,
        "discription": "\r\n                        a software system designed to support interoperable machine-to-machine interaction over the World Wide Web.\r\n                    "
    },
    "dictionary": {
        "count": 59524,
        "discription": "\r\n                        A dictionary maps keys to values allowing efficient retrieval of values by keys. *USE [map-function] TAG* for mapping functions over collections; and for geography, [maps].\r\n\r\n                    "
    },
    "datetime": {
        "count": 58372,
        "discription": "\r\n                        A DateTime object in many programming languages describes a date and a time of day.  It can express either an instant in time or a position on a calendar, depending on the context in which it is used …\r\n                    "
    },
    "xaml": {
        "count": 57238,
        "discription": "\r\n                        Extensible Application Markup Language (XAML) is a declarative XML-based language used for  initializing structured values and objects in various frameworks. When a question is about the usage of XAML…\r\n                    "
    },
    "android-layout": {
        "count": 56527,
        "discription": "\r\n                        A layout defines the visual structure for a user interface, such as the UI for an activity, fragment or app widget. \r\n                    "
    },
    "ruby-on-rails-3": {
        "count": 55992,
        "discription": "\r\n                        an open-source web development framework written in Ruby. Ruby on Rails follows the principle of convention over configuration, freeing you from having to re-invent things to stay pro…\r\n                    "
    },
    "for-loop": {
        "count": 55893,
        "discription": "\r\n                        a control structure used by many programming languages to iterate over a range. It is a way of repeating statements a number of times until the loop ends. Depending on the language this …\r\n                    "
    },
    "unity3d": {
        "count": 55040,
        "discription": "\r\n                        a cross-platform game engine with a built-in IDE developed by Unity Technologies.\r\n                    "
    },
    "spring-mvc": {
        "count": 54952,
        "discription": "\r\n                        A framework for building Java web applications based on the Model-View-Controller (MVC) pattern. It promotes flexible and decoupled code from the underlying view technologies.\r\n                    "
    },
    "oop": {
        "count": 54566,
        "discription": "\r\n                        a programming paradigm using \"objects\": data structures consisting of data fields and methods together with their interactions. \r\n                    "
    },
    "asp.net-core": {
        "count": 54527,
        "discription": "\r\n                        a lean, composable, and cross-platform framework for building web and cloud applications. It is a fully open-source on GitHub. ASP.NET Core apps can be run on Windows with the full .NE…\r\n                    "
    },
    "email": {
        "count": 54511,
        "discription": "\r\n                        for questions involving code to send or receive email messages. Posting to ask why the emails you send are marked as spam is off-topic for Stack Overflow.  Questions about configuration o…\r\n                    "
    },
    "matplotlib": {
        "count": 54370,
        "discription": "\r\n                        a plotting library for Python which may be used interactively or embedded in stand-alone GUIs. Its compact \"pyplot\" interface is similar to the plotting functions of MATLAB®.\r\n                    "
    },
    "object": {
        "count": 54295,
        "discription": "\r\n                        any entity that can be manipulated by commands in a programming language. An object can be a value, a variable, a function, or a complex data-structure. In object-oriented programming, an…\r\n                    "
    },
    "sql-server-2008": {
        "count": 53672,
        "discription": "\r\n                        for questions specific to the 2008 version of Microsoft's SQL Server.\r\n                    "
    },
    "c++11": {
        "count": 52773,
        "discription": "\r\n                        for code that must compile as C++11 (not using any features introduced in C++14 or later).\r\n                    "
    },
    "ms-access": {
        "count": 52565,
        "discription": "\r\n                        Microsoft Access, also known as Microsoft Office Access, is an application development and database development tool from Microsoft. It combines the Microsoft Jet/ACE Database Engine with a graphical …\r\n                    "
    },
    "parsing": {
        "count": 51837,
        "discription": "\r\n                        Parsing refers to breaking an artifact into its constituent elements and capturing the relationship between those elements. This tag isn't for questions about the self hosted Parse Platform (use the […\r\n                    "
    },
    "ubuntu": {
        "count": 51789,
        "discription": "\r\n                        OFF-TOPIC. Support questions may be asked on https://askubuntu.com/. Ubuntu is a free desktop and server operating system based on Debian GNU/Linux. Note that this is for pro…\r\n                    "
    },
    "security": {
        "count": 51669,
        "discription": "\r\n                        Topics relating to application security and attacks against software. Please don't use this tag alone, that results in ambiguity.\r\nIf your question is not about a specific programming problem, please …\r\n                    "
    },
    "jsp": {
        "count": 51488,
        "discription": "\r\n                        a Java-based view technology running on the server machine which allows you to write template text in (the client side languages like HTML, CSS, JavaScript and so on) and int…\r\n                    "
    },
    "user-interface": {
        "count": 50642,
        "discription": "\r\n                        the system through which people interact with a computer. This tag can be used for UI-related programming questions. Note that there's a separate Stack Exchange site for User In…\r\n                    "
    },
    "listview": {
        "count": 50636,
        "discription": "\r\n                        a graphical screen control or widget provided by UI libraries in a majority of modern operating systems to show items in a list form.\r\n                    "
    },
    "go": {
        "count": 50498,
        "discription": "\r\n                        an open-source programming language. It is statically-typed, with a syntax loosely derived from C, adding automatic memory management, type safety, some dynamic typing capabilities, additional b…\r\n                    "
    },
    "if-statement": {
        "count": 50260,
        "discription": "\r\n                        a flow control structure in most programming languages that branches execution flow depending on a binary condition, generally evaluated at runtime. If statements are also commonl…\r\n                    "
    },
    "wcf": {
        "count": 50221,
        "discription": "\r\n                        a part of the .NET Framework that provides a unified programming model for rapidly building service-oriented applications.\r\n                    "
    },
    "kotlin": {
        "count": 50100,
        "discription": "\r\n                        an open-source, statically typed programming language supported and developed by JetBrains. Kotlin combines OOP and functional features and is focused on interoperability, safety, clarity, a…\r\n                    "
    },
    "pointers": {
        "count": 49414,
        "discription": "\r\n                        Data type that \"points to\" another value stored in memory. A pointer variable contains a memory address of some other entity (variable or function or other entity). This tag should be used for questio…\r\n                    "
    },
    "batch-file": {
        "count": 49247,
        "discription": "\r\n                        a text file containing a series of commands that are executed by the command interpreter on MS-DOS, IBM OS/2, or Microsoft Windows systems.\r\n                    "
    },
    "authentication": {
        "count": 48437,
        "discription": "\r\n                        the process of providing a proof of identity or verifying identity.\r\n                    "
    },
    "templates": {
        "count": 48431,
        "discription": "\r\n                        is used in multiple contexts: generic programming (especially C++), and data/document generation using template engines. When using this tag on implementation heavy questions - tag t…\r\n                    "
    },
    "elasticsearch": {
        "count": 47879,
        "discription": "\r\n                        an Open Source (Apache 2), Distributed, RESTful, Search Engine based on Lucene.\r\n                    "
    },
    "variables": {
        "count": 47626,
        "discription": "\r\n                        AMBIGUOUS; USE SPECIFIC-LANGUAGE TAGS WHENEVER APPLICABLE. A variable is a named data storage location in memory. Using variables, a computer program can store numbers, text, binary data, or a…\r\n                    "
    },
    "delphi": {
        "count": 47067,
        "discription": "\r\n                        a language for rapid development of native Windows, macOS, Linux, iOS, and Android applications through use of Object Pascal. The name refers to the Delphi language as well as its libraries,…\r\n                    "
    },
    "visual-studio-2010": {
        "count": 46901,
        "discription": "\r\n                        an integrated development environment (IDE) from Microsoft. Use this tag only for questions arising from the use of this particular version of Visual Studio, and not about any co…\r\n                    "
    },
    "debugging": {
        "count": 46330,
        "discription": "\r\n                        a methodical process of finding and fixing bugs in a computer program. **IMPORTANT NOTE:** This tag is ONLY for questions about debugging techniques or the process of debugging itself, NO…\r\n                    "
    },
    "google-app-engine": {
        "count": 45487,
        "discription": "\r\n                        a cloud computing technology for hosting web applications in Google-managed data centers. Google App Engine is a Platform as a Service (PaaS) offering for Java, Python, Go, Node.j…\r\n                    "
    },
    "haskell": {
        "count": 45459,
        "discription": "\r\n                        a functional programming language featuring strong static typing, lazy evaluation, extensive parallelism and concurrency support, and unique abstraction capabilities.\r\n                    "
    },
    "nginx": {
        "count": 44921,
        "discription": "\r\n                        a web server, reverse proxy, TCP stream proxy and mail proxy, released under a BSD-like license.\r\n                    "
    },
    "ssl": {
        "count": 44752,
        "discription": "\r\n                        a cryptographic protocol that provides secure communications over the Internet. Often, SSL is used as a blanket term and refers to both the SSL protocol and the Transport…\r\n                    "
    },
    "pdf": {
        "count": 44684,
        "discription": "\r\n                        an open standard for electronic document exchange maintained by the International Organization for Standardization (ISO). Questions can be about creating, reading, ed…\r\n                    "
    },
    "jpa": {
        "count": 44593,
        "discription": "\r\n                        a Java specification for accessing, persisting, and managing data between Java objects/classes and a relational database. It is part of the EJB 3.0 specification and …\r\n                    "
    },
    "unix": {
        "count": 44451,
        "discription": "\r\n                        EXCLUSIVELY for PROGRAMMING questions that are directly related to Unix; general software issues should be directed to the Unix & Linux Stack Exchange site or to Super User. The Unix opera…\r\n                    "
    },
    "xamarin": {
        "count": 44449,
        "discription": "\r\n                        a platform consisting of Xamarin.iOS, Xamarin.Android, Xamarin.Mac and Xamarin Test Cloud. It allows you to write cross-platform native Apps for iOS, Android and Mac and follow your app thr…\r\n                    "
    },
    "machine-learning": {
        "count": 43799,
        "discription": "\r\n                        Implementation questions about machine learning algorithms. General questions about machine learning should be posted to their specific communities.\r\n                    "
    },
    "android-fragments": {
        "count": 43506,
        "discription": "\r\n                        Fragments represent reusable behaviors or portions of the user interface in an Android app. \r\n                    "
    },
    "jenkins": {
        "count": 43240,
        "discription": "\r\n                        an open source continuous integration tool written in Java, that has packages for Linux, Mac OS X, Windows, FreeBSD and OpenBSD. The project was forked from Hudson. \r\n                    "
    },
    "asynchronous": {
        "count": 42904,
        "discription": "\r\n                        a strategy for deferring operations with high latency or low priority, usually in an attempt to improve performance, responsiveness, and / or composability of software. Suc…\r\n                    "
    },
    "hadoop": {
        "count": 42810,
        "discription": "\r\n                        an Apache open-source project that provides software for reliable and scalable distributed computing. The core consists of a distributed file system (HDFS) and a resource manager (YARN). \r\n\r…\r\n                    "
    },
    "session": {
        "count": 42772,
        "discription": "\r\n                        A session refers to the communication between a single client and a server. A session is specific to the user and for each user a new session is created to track all the requests from that user. \r\n                    "
    },
    "generics": {
        "count": 42648,
        "discription": "\r\n                        a form of parametric polymorphism found in a range of languages, including .NET languages, Java, Swift, and Rust. \r\n                    "
    },
    "flask": {
        "count": 42415,
        "discription": "\r\n                        a lightweight framework for developing web applications using Python.\r\n                    "
    },
    "dart": {
        "count": 42322,
        "discription": "\r\n                        a class-based, statically(& strongly)-typed programming language for building web and mobile applications. Dart compiles to modern JavaScript to run in the browser and compiles to native code …\r\n                    "
    },
    "asp.net-mvc-4": {
        "count": 42295,
        "discription": "\r\n                        the fourth major version of the ASP.NET Model-View-Controller platform for web applications.\r\n                    "
    },
    "selenium-webdriver": {
        "count": 41806,
        "discription": "\r\n                        Selenium WebDriver provides the WebDriver API for controlling browsers in different programming languages (\"language bindings\"). When using this tag, also add a tag for the programming language you ar…\r\n                    "
    },
    "github": {
        "count": 41746,
        "discription": "\r\n                        a web-based hosting service for software development projects that use Git for version control. Use this tag for questions specific to problems with repositories hosted on GitHub, features s…\r\n                    "
    },
    "testing": {
        "count": 41720,
        "discription": "\r\n                        any activity aimed at evaluating an attribute or capability of a program or system and determining that it meets its required results.\r\n                    "
    },
    "web": {
        "count": 41638,
        "discription": "\r\n                        Do not use this tag. For questions related to an aspect of the world wide web, use a more specific tag for it, such as [uri], [html], [http] or [w3c].\r\n                    "
    },
    "ionic-framework": {
        "count": 41415,
        "discription": "\r\n                        a front-end framework for developing native-feeling hybrid mobile apps with HTML and Sass. Traditionally, it runs on top of Cordova and Angular, but since Ionic 4 it supports Angular, React, …\r\n                    "
    },
    "actionscript-3": {
        "count": 41329,
        "discription": "\r\n                        the open source object oriented programming (OOP) language of the Adobe Flash and AIR Platforms.  AS3 is widely used for RIAs, mobile apps, and desktop applications. (ActionScr…\r\n                    "
    },
    "gradle": {
        "count": 41083,
        "discription": "\r\n                        a project build automation tool that uses a Groovy DSL. Gradle build scripts support Maven and Ivy repositories as well as plain file system for dependency management.\r\n                    "
    },
    "tomcat": {
        "count": 40806,
        "discription": "\r\n                        for questions about Apache Tomcat (or simply Tomcat, formerly also Jakarta Tomcat) which is an open source Servlet Container developed by the Apache Software Foundation (ASF).  Most quest…\r\n                    "
    },
    "animation": {
        "count": 40077,
        "discription": "\r\n                        the rapid display of a sequence of visuals in order to create an illusion of movement or change.\r\n                    "
    },
    "url": {
        "count": 39817,
        "discription": "\r\n                        a universal identifier on the web. A URL is a reference to a web resource at a specific location, and provides a means for retrieving that resource.\r\n                    "
    },
    "jquery-ui": {
        "count": 39392,
        "discription": "\r\n                        a curated set of user interface interactions, effects, widgets, and themes built on top of the jQuery JavaScript Library.\r\n                    "
    },
    "curl": {
        "count": 39357,
        "discription": "\r\n                        a library and command-line tool for transferring data using various protocols such as HTTP, FTP and SFTP. The cURL project produces two products, libcurl and curl. This tag covers all usages o…\r\n                    "
    },
    "recursion": {
        "count": 39282,
        "discription": "\r\n                        a kind of function call in which a function calls itself. Such functions are also called recursive functions. Structural recursion is a method of problem solving where the solution to a p…\r\n                    "
    },
    "cocoa": {
        "count": 39136,
        "discription": "\r\n                        Apple's application-development framework for macOS, consisting of Foundation, Application Kit, and Core Data. Use the \"cocoa-touch\" tag for iOS questions.\r\n                    "
    },
    "internet-explorer": {
        "count": 38883,
        "discription": "\r\n                        A web browser developed by Microsoft and included with Windows.  Commonly abbreviated to \"IE\".\r\n                    "
    },
    "asp.net-mvc-3": {
        "count": 38579,
        "discription": "\r\n                        the third major version of Model-View-Controller extension for developing web applications in a .NET framework. \r\n                    "
    },
    "ggplot2": {
        "count": 38560,
        "discription": "\r\n                        an actively maintained open-source chart-drawing package for R, written by Hadley Wickham, based upon the principles of \"Grammar of Graphics\".  It partially replaces R's basic plot and the …\r\n                    "
    },
    "amazon-s3": {
        "count": 38376,
        "discription": "\r\n                        an online object storage service from Amazon Web Services. QUESTIONS MUST BE ABOUT PROGRAMMING. Questions about general S3 support, functionality, configuration, …\r\n                    "
    },
    "heroku": {
        "count": 38161,
        "discription": "\r\n                        a cloud platform for Ruby, Node.js, Python, Go, PHP, and JVM-based applications.  It features  Git-based, GitHub, and API deployment strategies, a large number of services offered as add-ons…\r\n                    "
    },
    "magento": {
        "count": 37882,
        "discription": "\r\n                        General Magento questions (like administration) may be asked on https://magento.stackexchange.com Magento is an e-commerce platform written in PHP. Questions should be related to writing code for Mage…\r\n                    "
    },
    "inheritance": {
        "count": 37848,
        "discription": "\r\n                        the system in object oriented programming that allows objects to support operations defined by anterior types without having to provide their own definition. It is the major vector for …\r\n                    "
    },
    "exception": {
        "count": 37793,
        "discription": "\r\n                        an unusual condition that requires deviation from the program's normal flow. Normally, an exception should not result in total failure, but instead be attended by an exception handler.…\r\n                    "
    },
    "laravel-5": {
        "count": 37469,
        "discription": "\r\n                        the previous major version of the open-source PHP web development MVC framework created by Taylor Otwell. Laravel helps you create applications using simple, expressive syntax.  Use the l…\r\n                    "
    },
    "join": {
        "count": 37450,
        "discription": "\r\n                        a general operation in relational algebra for a combining operation on two or more relations in a relational database system. JOIN is also keyword of the SQL language for performing this ope…\r\n                    "
    },
    "math": {
        "count": 37444,
        "discription": "\r\n                        Math involves the manipulation of numbers within a program. For general math questions, please ask on math.stackexchange.com. Note: If your question is about unexpected results in floating point calcu…\r\n                    "
    },
    "winapi": {
        "count": 37319,
        "discription": "\r\n                        The Windows API (formerly called the Win32 API) is the core set of application programming interfaces available for the Microsoft Windows operating systems. This tag is for questions about developing …\r\n                    "
    },
    "redirect": {
        "count": 37128,
        "discription": "\r\n                        A response by a webserver, that asks the user agent to not show the response body, but instead request a different resource. Questions can be related to Redirect Protocols, Link Equity and Types of Re…\r\n                    "
    },
    "svg": {
        "count": 37074,
        "discription": "\r\n                        an XML-based two-dimensional vector graphics format that can also be used in HTML. Do not add this tag just because your project uses SVG. Instead, add the tag if you…\r\n                    "
    },
    "post": {
        "count": 37049,
        "discription": "\r\n                        one of the HTTP protocol methods; it is used when the client needs to send data to the server, such as when uploading a file, or submitting a completed form. The word post has several meanings…\r\n                    "
    },
    "firefox": {
        "count": 36830,
        "discription": "\r\n                        a free, open-source cross-platform web browser. Use this tag if your question is related to the inner workings of Firefox or if it relates to code that is not working on Firefox whi…\r\n                    "
    },
    "image-processing": {
        "count": 36826,
        "discription": "\r\n                        Anything related to digital image processing, i.e. the theory and the techniques used to extract or manipulate information from digital images.\r\n\r\n                    "
    },
    "d3.js": {
        "count": 36759,
        "discription": "\r\n                        a JavaScript library for creating interactive data-bound visualisations of documents using HTML, SVG, and Canvas.\r\n                    "
    },
    "dom": {
        "count": 36747,
        "discription": "\r\n                        a way to programmatically refer to the elements of a markup language like XML and HTML. Use with [javascript] or any other programming language that has a DOM parser\r…\r\n                    "
    },
    "ruby-on-rails-4": {
        "count": 36613,
        "discription": "\r\n                        For issues specific to version 4 of Rails. If your question applies to Ruby on Rails in general, use the tag [ruby-on-rails].\r\n                    "
    },
    "assembly": {
        "count": 36401,
        "discription": "\r\n                        Assembly language questions. Please tag the processor and/or the instruction set you are using, as well as the assembler, a valid set should be like this: (assembly, x86, gnu) Note that you should use…\r\n                    "
    },
    "intellij-idea": {
        "count": 36203,
        "discription": "\r\n                        an IDE by JetBrains. It primarily supports Java development, but also supports JavaScript, Groovy, HTML, CSS, RSS, R, Haskell, PHP, Ruby, Python, Scala, Swift, Clojure, Kotlin, Hybris…\r\n                    "
    },
    "select": {
        "count": 36117,
        "discription": "\r\n                        a common keyword used to query data. 'select()' is also a programming function for triggering code based on file handle or other system activity. Do not use this tag for questions related to…\r\n                    "
    },
    "tkinter": {
        "count": 36077,
        "discription": "\r\n                        the standard Python interface to the \"Tk\" graphical user interface toolkit.\r\nIn Python 3, the name of the module changed from Tkinter to tkinter.\r\n                    "
    },
    "google-apps-script": {
        "count": 36076,
        "discription": "\r\n                        Use for questions about Google Apps Script, Google's JavaScript-based cloud scripting platform for automating tasks across Google products and third-party services. Use in addition to relevant product…\r\n                    "
    },
    "npm": {
        "count": 35899,
        "discription": "\r\n                        the package manager shipped with Node.js. It can be used to install and publish CommonJS and ECMAScript modules, jQuery plugins, reusable JavaScript code (libraries), JavaScript-based CLI progr…\r\n                    "
    },
    "gcc": {
        "count": 35763,
        "discription": "\r\n                        the GNU Compiler Collection. It's the de facto standard compiler for C, C++, Go, Fortran, and Ada on Linux and supports many other languages and platforms as well.\r\n                    "
    },
    "button": {
        "count": 35716,
        "discription": "\r\n                        simple elements in graphical user interfaces that take mouse clicks or finger taps (on touch devices) as input.\r\n                    "
    },
    "opengl": {
        "count": 35572,
        "discription": "\r\n                        a graphics standard and API which is platform independent and available for desktop, workstation and mobile devices. It is designed to provide hardware-accelerated re…\r\n                    "
    },
    "logging": {
        "count": 35538,
        "discription": "\r\n                        the process of recording events in a computer program or computer system, usually with a certain scope, in order to provide an audit trail that can be used to understand the a…\r\n                    "
    },
    "matrix": {
        "count": 35296,
        "discription": "\r\n                        In mathematics, a matrix (plural matrices) is a rectangular array of numbers, symbols, or expressions, arranged in rows and columns. The individual items in a matrix are called its elements or entries…\r\n                    "
    },
    "mongoose": {
        "count": 35211,
        "discription": "\r\n                        a MongoDB object modeling tool, or ODM (Object Document Mapper), written in JavaScript and designed to work in an asynchronous environment.\r\n                    "
    },
    "flash": {
        "count": 35207,
        "discription": "\r\n                        For questions on Adobe's cross-platform multimedia runtime used to embed animations, video, and interactive applications into web pages. For questions related to memory, use the tag [flash-memory].\r\n                    "
    },
    "xslt": {
        "count": 35201,
        "discription": "\r\n                        a transformation language for XML designed to transform structured documents into other formats (such as XML, HTML, and plain text, or, in XSLT 3, JSON). Questions should use one of the xslt-1…\r\n                    "
    },
    "iis": {
        "count": 35195,
        "discription": "\r\n                        a web server created by Microsoft for use with Microsoft Windows. Please mention which version of IIS you're running either in your question or by adding a versi…\r\n                    "
    },
    "jsf": {
        "count": 35166,
        "discription": "\r\n                        a model-view-presenter framework typically used to create HTML form based web applications.\r\n\r\nUsing the standard components and render kit, stateful HTML views can be define…\r\n                    "
    },
    "events": {
        "count": 35072,
        "discription": "\r\n                        a way for a class to provide notifications to listeners when a particular thing happens.\r\n                    "
    },
    "caching": {
        "count": 34741,
        "discription": "\r\n                        a mechanism for temporarily storing (caching) data locally in order to reduce access time to data stored far away. For CPU/disk/web browsing please use relevant tags (cpu-cache, diskcache,.…\r\n                    "
    },
    "javafx": {
        "count": 34669,
        "discription": "\r\n                        The JavaFX platform enables developers to create and deploy Graphical User Interface (GUI) applications that behave consistently across multiple platforms.  JavaFX 1.3 and older, were scripting langua…\r\n                    "
    },
    "ipad": {
        "count": 34668,
        "discription": "\r\n                        a tablet computer designed by Apple running the iOS operating system. iPad applications are usually written in Objective-C or Swift in the Xcode IDE, although it is also possible to use other …\r\n                    "
    },
    "cocoa-touch": {
        "count": 34607,
        "discription": "\r\n                        The Cocoa Touch Frameworks that drive iOS apps share many proven patterns found on the Mac, but were built with a special focus on touch-based interfaces and optimization.\r\n                    "
    },
    "webpack": {
        "count": 34414,
        "discription": "\r\n                        a static module bundler for modern JavaScript applications.\r\n\r\nWebpack takes modules with dependencies and generates static assets representing those modules. Webpack enables extensibility …\r\n                    "
    },
    "asp.net-web-api": {
        "count": 34406,
        "discription": "\r\n                        a framework for building HTTP services for clients like browsers and mobile devices. It is based on the Microsoft .NET Framework and an ideal choice for building RESTful services.\r\n                    "
    },
    "facebook-graph-api": {
        "count": 34277,
        "discription": "\r\n                        a structured API for fetching objects and the connections between them from Facebook's social graph\r\n                    "
    },
    "networking": {
        "count": 34189,
        "discription": "\r\n                        For most programming questions use [network-programming] tag. Non-programming networking questions are off topic and should be asked on Network Engineering, Super User or Server Fault instead.  This t…\r\n                    "
    },
    "search": {
        "count": 34180,
        "discription": "\r\n                        Questions about search algorithm mechanics and implementation.  *NOT* for questions about using search tools within an API (e.g. Google, Bing, Facebook).\r\n                    "
    },
    "xpath": {
        "count": 34110,
        "discription": "\r\n                        to address parts of an XML document. It also provides basic facilities for manipulation of strings, numbers and booleans. XPath uses a compact, non-XML syntax. XPath op…\r\n                    "
    },
    "web-scraping": {
        "count": 33887,
        "discription": "\r\n                        the process of extracting specific information from websites that do not readily provide an API or other methods of automated data retrieval. Questions about \"How To Get Started With S…\r\n                    "
    },
    "stored-procedures": {
        "count": 33860,
        "discription": "\r\n                        A subroutine available to applications accessing a relational database system.\r\n                    "
    },
    "kubernetes": {
        "count": 33703,
        "discription": "\r\n                        KUBERNETES QUESTIONS MUST BE DEVELOPER RELATED. Kubernetes is an open-source platform designed to automate deployment, scaling, and operation of application containers, across multiple hosts and/or cl…\r\n                    "
    },
    "firebase-realtime-database": {
        "count": 33623,
        "discription": "\r\n                        a cloud hosted, NoSQL, JSON database that provides offline caching and synchronization. Do NOT use this tag for questions about Cloud Firestore; instead use the [google-c…\r\n                    "
    },
    "django-models": {
        "count": 32930,
        "discription": "\r\n                        For questions concerning use of the model class from the web framework Django.\r\n                    "
    },
    "optimization": {
        "count": 32905,
        "discription": "\r\n                        the act of improving a method or design. In programming, optimization usually takes the form of increasing the speed of an algorithm, or reducing the resources it requires. Another mea…\r\n                    "
    },
    "encryption": {
        "count": 32832,
        "discription": "\r\n                        the process of transforming information (called plaintext) into an unreadable form (called ciphertext) using an encryption algorithm combined with a parameter (called an encryption key).…\r\n                    "
    },
    "audio": {
        "count": 32714,
        "discription": "\r\n                        Sound and programming audio hardware, and the various audio formats or containers. For questions specific to sounds playback, use [audio-player] or [playback], and for questions specific to sounds rec…\r\n                    "
    },
    "canvas": {
        "count": 32700,
        "discription": "\r\n                        a generic term for the drawing surface used with many free-form graphics output APIs. Use this tag with other tags that indicate the specific graphics API that is being used along with the p…\r\n                    "
    },
    "servlets": {
        "count": 32564,
        "discription": "\r\n                        a Java application programming interface (API) running on the server machine which can intercept the requests made by the client and can generate/send a response accordingly.\r\n                    "
    },
    "keras": {
        "count": 32467,
        "discription": "\r\n                        a neural network library providing a high-level API in Python and R. Use this tag for questions relating to how to use this API. Please also include the tag for the language/backend ([python]…\r\n                    "
    },
    "memory": {
        "count": 32055,
        "discription": "\r\n                        for memory management or issues in programming. For questions about memory hardware issues or errors in general software, go to https://superuser.com, or https://serverfault.com if this i…\r\n                    "
    },
    "mod-rewrite": {
        "count": 31386,
        "discription": "\r\n                        URL rewriting module for the Apache web server. It is commonly used for so-called `pretty URLs` , but also provides the power and flexibility to perform various request handling tasks beyond simple su…\r\n                    "
    },
    "video": {
        "count": 31377,
        "discription": "\r\n                        an electronic medium for the recording, copying, and broadcasting of moving visual images. Use more specific tags when relevant, such as [video-editing] for questions related to trimming and …\r\n                    "
    },
    "arraylist": {
        "count": 31375,
        "discription": "\r\n                        A simple collection data type found in some languages / platforms (such as in Java or .NET). The array list implements a list using an array, benefiting from both the DSs strengths.\r\n                    "
    },
    "model-view-controller": {
        "count": 31332,
        "discription": "\r\n                        an architectural pattern used in software engineering. For Microsoft ASP.NET MVC, please use [asp.net-mvc] or [asp.net-core-mvc] tag instead. For Spring MVC, please use …\r\n                    "
    },
    "google-sheets": {
        "count": 31280,
        "discription": "\r\n                        for questions about interacting with Google Sheets programmatically. Use with: 1.[google-apps-script] for questions relating to inbuilt scripting language, 2.[google-sheets-formula] for q…\r\n                    "
    },
    "cookies": {
        "count": 31238,
        "discription": "\r\n                        a piece of data stored by the user's web browser. Unless otherwise specified, cookies can be created, read, modified and deleted both by JavaScript and from server-side through HTTP …\r\n                    "
    },
    "cakephp": {
        "count": 31191,
        "discription": "\r\n                        an open-source web, rapid development framework for PHP that provides an extensible architecture for developing, maintaining, and deploying applications. It uses commonly known design patte…\r\n                    "
    },
    "plot": {
        "count": 31120,
        "discription": "\r\n                        The graphical representation of a mathematical function or a set of data. There are different kinds of plots, such as line plots, bar plots, or scatter plots.\r\n                    "
    },
    "vector": {
        "count": 30830,
        "discription": "\r\n                        a single-dimensional array: it contains components that can be accessed using an integral index. In some languages the size of a vector can grow or shrink as needed to accommodate adding a…\r\n                    "
    },
    "multidimensional-array": {
        "count": 30776,
        "discription": "\r\n                        Multidimensional-arrays can be described as multi-dimensional tables. Each index used in order to find a given element is called a dimension.\r\n                    "
    },
    "razor": {
        "count": 30582,
        "discription": "\r\n                        a template language used by ASP.NET Web Pages, ASP.NET MVC (since version 3), and ASP.NET Core. It adds a layer of abstraction above HTML generation. It supports seamless transitions between …\r\n                    "
    },
    ".net-core": {
        "count": 30406,
        "discription": "\r\n                        an open-source successor  of the .NET Framework. It can be used in a wide variety of applications and verticals, ranging from servers and data centers to apps and devices. .NET Core is su…\r\n                    "
    },
    "jdbc": {
        "count": 30327,
        "discription": "\r\n                        the base API which enables interacting with SQL database servers by executing SQL statements using the Java programming language.\r\n                    "
    },
    "serialization": {
        "count": 30182,
        "discription": "\r\n                        the process by which data-structures are converted into a format that can be easily stored or transmitted and subsequently reconstructed.\r\n                    "
    },
    "random": {
        "count": 30117,
        "discription": "\r\n                        for questions pertaining to random numbers and their generators, whether pseudo-random or truly random.\r\n                    "
    },
    "iframe": {
        "count": 30090,
        "discription": "\r\n                        an HTML element that creates an \"inline frame\" within a document, which allows displaying a separate document in the same page.\r\n                    "
    },
    "amazon-ec2": {
        "count": 30069,
        "discription": "\r\n                        Amazon EC2 stands for \"Amazon Elastic Compute Cloud\". It is a part of Amazon Web Services (AWS) and allows users to rent virtual machine instances. You can create instances, launch and manage them thr…\r\n                    "
    },
    "android-intent": {
        "count": 29792,
        "discription": "\r\n                        Questions regarding practical and advanced use of Intents, Intent Extras and Pending Intents to start an Activity, Service or to respond to a system or application event/notification via a BroadcastRe…\r\n                    "
    },
    "visual-studio-code": {
        "count": 29613,
        "discription": "\r\n                        an open source text editor available for Linux, OS X, and Windows. It includes support for debugging, embedded Git control, various extensions and rich development experiences su…\r\n                    "
    },
    "input": {
        "count": 29504,
        "discription": "\r\n                        usually related to user input, i.e., to the data that user supplies to a running application. In many systems this input is considered to be potentially dangerous and needs to be sanitized to…\r\n                    "
    },
    "design-patterns": {
        "count": 29382,
        "discription": "\r\n                        a general reusable solution to a commonly occurring problem in software design. Use this tag for questions when you're having problems with the implementation of design-patterns. P…\r\n                    "
    },
    "grails": {
        "count": 29335,
        "discription": "\r\n                        an Open Source, full stack, web application framework that uses the Groovy programming language (which is in turn based on the Java virtual machine (JVM) and Java. The framework is oriented …\r\n                    "
    },
    "jakarta-ee": {
        "count": 29168,
        "discription": "\r\n                        Jakarta EE (formerly known as Java Enterprise Edition, Java EE, and J2EE) is a specification defining a collection of Java-based server and client technologies and how they interoperate. This is the m…\r\n                    "
    },
    "visual-c++": {
        "count": 29015,
        "discription": "\r\n                        a C, C++ and C++/CLI compiler for Windows. The most recent version of the compiler is Visual C++ 2019.\r\n\r\nThe compiler supports the following languages:\r\n\r\nC (supports C90 and …\r\n                    "
    },
    "meteor": {
        "count": 28735,
        "discription": "\r\n                        a modular platform for developing web and mobile applications in JavaScript based on the NodeJS platform.\r\n                    "
    },
    "indexing": {
        "count": 28718,
        "discription": "\r\n                        a general technique to improve the speed of data lookups.\r\n                    "
    },
    "awk": {
        "count": 28331,
        "discription": "\r\n                        an interpreted programming language designed for text processing and typically used as a data extraction and reporting tool.  AWK is used largely with Unix systems.\r\n                    "
    },
    "android-activity": {
        "count": 28052,
        "discription": "\r\n                        Questions about creating or managing Activities in Android. In Android Applications, an Activity is a Component that provides a user interface allowing the user to do something. Simple examples are: d…\r\n                    "
    },
    "xamarin.forms": {
        "count": 28026,
        "discription": "\r\n                        a Microsoft product allowing the building of native, cross-platform apps for Android, iOS, Windows, and others from a single shared C# codebase.\r\n                    "
    },
    "data-structures": {
        "count": 27983,
        "discription": "\r\n                        a way of organizing data in a fashion that allows particular properties of that data to be queried and/or updated efficiently.\r\n                    "
    },
    "text": {
        "count": 27971,
        "discription": "\r\n                        a sequence of characters that is most often used to represent a cohesive piece of information.\r\n                    "
    },
    "redux": {
        "count": 27704,
        "discription": "\r\n                        a predictable state container for JavaScript applications based on the Flux design pattern.\r\n                    "
    },
    "checkbox": {
        "count": 27623,
        "discription": "\r\n                        a graphical user interface element that permits the user to make a binary selection.\r\n                    "
    },
    "core-data": {
        "count": 27568,
        "discription": "\r\n                        Apple's object modeling and persistence framework for iOS, iPadOS, tvOS, watchOS, and macOS. Xcode provides an object model editor for specifying entities, attributes, and relationships.\r\n                    "
    },
    "activerecord": {
        "count": 27554,
        "discription": "\r\n                        a pattern that combines domain logic with storage abstraction in single object. Use this tag for questions about the pattern, [rails-activerecord] for questions about the Rails ORM fr…\r\n                    "
    },
    "mobile": {
        "count": 27385,
        "discription": "\r\n                         should be used to mark questions regarding mobile computing issues. Mobile computing is a form of human–computer interaction by which a computer is expected to be transported during nor…\r\n                    "
    },
    "silverlight": {
        "count": 27376,
        "discription": "\r\n                        Microsoft's cross-browser, cross platform plug-in for media experiences and rich interactive applications.\r\n                    "
    },
    "mvvm": {
        "count": 27256,
        "discription": "\r\n                        an architectural design pattern for implementing user interfaces that separates the UI (the View) from its data (the Model) via its presentation logic (its ViewModel).\r\n                    "
    },
    "methods": {
        "count": 27069,
        "discription": "\r\n                        a block of code that performs a task and is associated with a class or an object. It is related to the non-object-oriented concepts of functions and procedures.\r\n                    "
    },
    "google-cloud-platform": {
        "count": 26840,
        "discription": "\r\n                        Google Cloud Platform provides cloud computing services that let you build applications and websites, store data, and analyze data on Google's infrastructure.\r\n                    "
    },
    "sharepoint": {
        "count": 26695,
        "discription": "\r\n                        For SharePoint-specific questions, please see the SharePoint Stack Exchange (https://sharepoint.stackexchange.com) site. Use this tag for programming questions which may involve SharePoint.\r\nMicrosoft…\r\n                    "
    },
    "soap": {
        "count": 26548,
        "discription": "\r\n                        a protocol specification for exchanging structured information in the implementation of Web Services.\r\n                    "
    },
    "installation": {
        "count": 26434,
        "discription": "\r\n                        the process of deploying an application, driver, plugin, etc. onto a device for future execution and use.\r\n                    "
    },
    "woocommerce": {
        "count": 26403,
        "discription": "\r\n                        an open source eCommerce plugin available for WordPress. Questions should relate to programming which changes or extends WooCommerce behaviour.\r\n                    "
    },
    "svn": {
        "count": 26391,
        "discription": "\r\n                        for questions about SVN (Subversion), a centralized open-source revision control system distributed under the Apache License.\r\n                    "
    },
    "ecmascript-6": {
        "count": 26344,
        "discription": "\r\n                        The 2015 version of the ECMAScript specification, now a standard (ECMAScript 2015). Only use this tag where the question specifically relates to new features or technical changes provided in ECMAScrip…\r\n                    "
    },
    "vim": {
        "count": 26240,
        "discription": "\r\n                        a free and open-source modal text editor available for most major platforms. It allows high efficiency in many text editing tasks but has a steep learning curve. To learn the basics, run \":help…\r\n                    "
    },
    "groovy": {
        "count": 26182,
        "discription": "\r\n                        an object-oriented programming language for the Java platform. It is a dynamic language with features similar to those of Python, Ruby, Perl and Smalltalk. It can be used as a scripting lang…\r\n                    "
    },
    "gridview": {
        "count": 26171,
        "discription": "\r\n                        a control for displaying and manipulating data from a variety of data sources.\r\n                    "
    },
    "mysqli": {
        "count": 25968,
        "discription": "\r\n                        a PHP database driver. Not to be confused with MySQL database.\r\n                    "
    },
    "struct": {
        "count": 25793,
        "discription": "\r\n                        A keyword in various programming languages whose syntax is similar to or derived from C (C++, C#, Swift, Go, Rust, etc.). Use a specific programming language tag to tag questions involving use of a `s…\r\n                    "
    },
    "file-upload": {
        "count": 25769,
        "discription": "\r\n                        a method or action of transferring a file from a client to a server.\r\n                    "
    },
    "time": {
        "count": 25672,
        "discription": "\r\n                        Measuring the time it takes to perform an operation. Also, questions related to obtaining the current time, calculating on times, formatting and parsing times, etc.\r\n                    "
    },
    "c#-4.0": {
        "count": 25652,
        "discription": "\r\n                        C# 4.0 introduced features like dynamic objects, COM interoperability improvements, generic co- and contra-variance, optional and named parameters. Use this tag if your question specifically pertains …\r\n                    "
    },
    "boost": {
        "count": 25457,
        "discription": "\r\n                        a large collection of high-quality libraries intended for use in C++. Boost is free, and is often considered a \"second standard library\".\r\n                    "
    },
    "lambda": {
        "count": 25440,
        "discription": "\r\n                        DO NOT USE FOR THE AWS SERVICE (use [aws-lambda] for those questions!) \r\n\r\nLambdas are anonymous functions or closures in programming languages such as Lisp, C#, C++, Lua, Python, Ruby, JavaScript, or…\r\n                    "
    },
    "ssh": {
        "count": 25403,
        "discription": "\r\n                        OFF-TOPIC. Support questions may be asked on https://superuser.com. Secure Shell (SSH) is a cryptographic network protocol for secure data communication. Use this tag for progra…\r\n                    "
    },
    "memory-management": {
        "count": 25325,
        "discription": "\r\n                        Process of dynamically allocating and freeing portions of physical memory in order to respond to program requests with, if possible, fairness and no starvation among the requesters.\r\n                    "
    },
    "android-recyclerview": {
        "count": 25313,
        "discription": "\r\n                        a more advanced and flexible version of ListView and GridView. \r\n                    "
    },
    "sed": {
        "count": 25071,
        "discription": "\r\n                        a command line editor for POSIX environment. Sed processes one or more files according to an editing script and writes the results to standard output. Created at Bell Labs, it h…\r\n                    "
    },
    "layout": {
        "count": 25051,
        "discription": "\r\n                        is for questions about the placement, alignment and justification of objects with respect to a containing element. For questions pertaining to CSS, use the 'css' tag instead.\r\n                    "
    },
    "dynamic": {
        "count": 24902,
        "discription": "\r\n                        a widely used term that, in general, describes a decision made by the program at run-time rather than at compile time.\r\n                    "
    },
    "filter": {
        "count": 24834,
        "discription": "\r\n                        A program or routine that blocks access to data that meet a particular criterion. An example would be a \"Web filter\" that screens out adult websites. Do NOT use this tag for: Java servlet filters. Use…\r\n                    "
    },
    "google-maps-api-3": {
        "count": 24618,
        "discription": "\r\n                        Google Maps JavaScript API Version 3 lets you embed the functionality of Google Maps into your own website.  Version 3 provides greatly improved support for mobile devices. Ask non-programming and lic…\r\n                    "
    },
    "graph": {
        "count": 24592,
        "discription": "\r\n                        This \"graph\" tag refers to a graphic (such as a chart or diagram) which displays the relationship between two or more variables.\r\n\r\nFor the discrete mathematics structure consisting of vertices and ed…\r\n                    "
    },
    "google-chrome-extension": {
        "count": 24521,
        "discription": "\r\n                        Extension development for the Google Chrome web browser. You write them using web technologies such as HTML, JavaScript, and CSS.\r\n                    "
    },
    "plsql": {
        "count": 24298,
        "discription": "\r\n                        PL/SQL (Procedural Language/Structured Query Language) is Oracle Corporation's procedural language extension for SQL. Questions about PL/SQL should probably be tagged \"oracle\" as well. Questions with …\r\n                    "
    },
    "extjs": {
        "count": 24234,
        "discription": "\r\n                        a JavaScript framework for building rich Internet applications (RIAs).\r\n                    "
    },
    "junit": {
        "count": 24220,
        "discription": "\r\n                        Popular unit testing framework for Java and Scala. The latest version, JUnit 5, supports rich annotation-based and parameterized tests. Consider using in conjunction with the Java or Scala tag to indi…\r\n                    "
    },
    "browser": {
        "count": 24206,
        "discription": "\r\n                        a software application for retrieving, presenting, and traversing information resources on the World Wide Web.\r\n                    "
    },
    "apache-flex": {
        "count": 24112,
        "discription": "\r\n                        a framework for developing Rich Internet Applications that run in Flash Player or Adobe Air. Originally designed by Adobe, Flex was donated to the Apache Software Foun…\r\n                    "
    },
    "spring-security": {
        "count": 24072,
        "discription": "\r\n                        the Spring Framework's application security solution. Spring security can be used to secure URLs and method invocations. It is widely used to secure standalone web applications, por…\r\n                    "
    },
    "dll": {
        "count": 23934,
        "discription": "\r\n                        a module that contains functions and data that can be used by another module (application or DLL). It is Microsoft's implementation of the shared library concept in the…\r\n                    "
    },
    "replace": {
        "count": 23860,
        "discription": "\r\n                        the action of searching a string for a sub-string and replacing it with a different string. \r\n                    "
    },
    "reporting-services": {
        "count": 23794,
        "discription": "\r\n                        a server-based report generator from Microsoft. It provides a full range of ready-to-use tools and services to help you create, deploy, and manage reports for y…\r\n                    "
    },
    "twitter": {
        "count": 23740,
        "discription": "\r\n                        a microblogging service that lets users post short \"Tweets\" of up to 280 characters. These can also be posted via its API.\r\n                    "
    },
    "google-cloud-firestore": {
        "count": 23722,
        "discription": "\r\n                        an auto-scaling real-time document database for storing, syncing, and querying data for mobile, web and server development.\r\n                    "
    },
    "pyspark": {
        "count": 23714,
        "discription": "\r\n                        The Spark Python API (PySpark) exposes the apache-spark programming model to Python.\r\n                    "
    },
    "ember.js": {
        "count": 23672,
        "discription": "\r\n                        a component-service application framework written in JavaScript.  Consider making your question easier to answer by using the preconfigured templates mentioned in this tag's wiki. (Always …\r\n                    "
    },
    "bootstrap-4": {
        "count": 23653,
        "discription": "\r\n                        the fourth major version of the popular front-end component library. The Bootstrap framework aids in the creation of responsive, mobile-first websites and web apps.\r\n                    "
    },
    "netbeans": {
        "count": 23507,
        "discription": "\r\n                        NetBeans refers to both a platform framework for Java desktop applications, and an integrated development environment (IDE) for developing with Java and other languages.\r\n                    "
    },
    "plugins": {
        "count": 23376,
        "discription": "\r\n                        a set of software components that adds specific abilities to a larger software application. If supported, plug-ins enable customizing the functionality of an application.\r\n                    "
    },
    "beautifulsoup": {
        "count": 23353,
        "discription": "\r\n                        a Python package for parsing HTML/XML. The latest version of this package is version 4, imported as bs4.\r\n                    "
    },
    "charts": {
        "count": 23281,
        "discription": "\r\n                        a graphical representation of data, most often in the format of a graph or diagram.\r\n\r\nUse this tag for questions about using a charting library API.\r\n                    "
    },
    "pdo": {
        "count": 23170,
        "discription": "\r\n                        a data-access abstraction layer (interface) for PHP. It works with most database systems.\r\n                    "
    },
    "visual-studio-2012": {
        "count": 23096,
        "discription": "\r\n                        a version of Microsoft's Visual Studio. Do not use this tag unless you have a specific question about Visual Studio -- not just a coding issue.\r\n                    "
    },
    "highcharts": {
        "count": 23077,
        "discription": "\r\n                        a Javascript charting library that uses HTML, SVG, and VML. The editor offers both open source/nonprofit and commercial editions of the product.\r\n                    "
    },
    "reflection": {
        "count": 23051,
        "discription": "\r\n                        the ability of a program to observe and/or modify its structure and/or behavior at runtime. Reflection is dependent on the supporting programming language - please tag the programming la…\r\n                    "
    },
    "unicode": {
        "count": 23007,
        "discription": "\r\n                        a standard for the encoding, representation and handling of text with the intention of supporting all the characters required for written text incorporating all writing systems, technical s…\r\n                    "
    },
    "types": {
        "count": 22874,
        "discription": "\r\n                        used to enforce levels of abstraction in programs.\r\n                    "
    },
    "jquery-mobile": {
        "count": 22791,
        "discription": "\r\n                        a touch-optimized web framework for smartphones and tablets. It provides a unified user interface system across all popular mobile device platforms, built on jQuery.\r\n                    "
    },
    "cmd": {
        "count": 22790,
        "discription": "\r\n                        the Microsoft supplied command line interpreter on OS/2, Windows CE, and all Microsoft Windows operating systems. Use this tag for questions regarding progr…\r\n                    "
    },
    "dependency-injection": {
        "count": 22557,
        "discription": "\r\n                        A design pattern to reduce coupling between components, by dynamically injecting into a software component dependencies that it needs to function.\r\n                    "
    },
    "database-design": {
        "count": 22551,
        "discription": "\r\n                        the process of specifying the structure and thus the logical aspects of a database. The goal of database design is to make a representation of some \"universe of discourse\" - the typ…\r\n                    "
    },
    "foreach": {
        "count": 22407,
        "discription": "\r\n                        a looping construct that executes a given piece of code for each element in a list/collection/array. In contrast to a for loop, the foreach loop doesn't require the coder to maintain a coun…\r\n                    "
    },
    "websocket": {
        "count": 22313,
        "discription": "\r\n                        an API built on top of TCP sockets and a protocol for bi-directional, full-duplex communication between client and server without the overhead of HTTP.\r\n                    "
    },
    "https": {
        "count": 22308,
        "discription": "\r\n                        Hypertext Transfer Protocol Secure (HTTPS) is a combination of the Hypertext Transfer Protocol with the SSL/TLS protocol to provide encrypted communication and secure identification of a network web s…\r\n                    "
    },
    "excel-formula": {
        "count": 22224,
        "discription": "\r\n                        for Microsoft Excel questions where the question or answers are specifically about the structure, syntax, or output of an Excel formula.\r\n                    "
    },
    "import": {
        "count": 22205,
        "discription": "\r\n                        The general process of moving data from an external source into one's platform, program, or data set.\r\n                    "
    },
    "data-binding": {
        "count": 22040,
        "discription": "\r\n                        A general technique that binds two data/information sources together and maintains them in sync.\r\n                    "
    },
    "dplyr": {
        "count": 22036,
        "discription": "\r\n                        for questions relating to functions from the dplyr package, such as group_by, summarize, filter, and select.\r\n\r\n                    "
    },
    "encoding": {
        "count": 22003,
        "discription": "\r\n                        a set of predefined rules to reversibly transform a piece of information in a certain representation into a completely different representation. The other way round is called decoding. Thi…\r\n                    "
    },
    "apache-kafka": {
        "count": 22003,
        "discription": "\r\n                        a distributed streaming platform designed to store and process high-throughput data streams.\r\n                    "
    },
    "hash": {
        "count": 21891,
        "discription": "\r\n                        any well-defined procedure or mathematical function that converts a large amount of data into a small datum, usually a single integer.\r\nFor questions about hashtags as used to label…\r\n                    "
    },
    "scikit-learn": {
        "count": 21883,
        "discription": "\r\n                        a machine-learning library for Python that provides simple and efficient tools for data analysis and data mining, with a focus on machine learning. It is accessible to everybody and re…\r\n                    "
    },
    "deployment": {
        "count": 21843,
        "discription": "\r\n                        A series of activities that makes a program available for use (usually in test or production environments)\r\n                    "
    },
    "service": {
        "count": 21815,
        "discription": "\r\n                        a long-running executable that performs specific functions and which is designed not to require user intervention.\r\n                    "
    },
    "error-handling": {
        "count": 21807,
        "discription": "\r\n                        Programming language constructs designed to handle errors signaled by error codes, exceptions or other language specific means.\r\n                    "
    },
    "collections": {
        "count": 21723,
        "discription": "\r\n                        Collections APIs provide developers with a set of classes and interfaces that make it easier to handle collections of objects.\r\n                    "
    },
    "makefile": {
        "count": 21636,
        "discription": "\r\n                        an input file for the build control language/tool make. It specifies targets and dependencies along with associated commands to perform (a.k.a. recipes) to update the targets. \r\n\r\n                    "
    },
    "sass": {
        "count": 21610,
        "discription": "\r\n                        Sass (Syntactically Awesome Style Sheets) is an extension of CSS adding features like nested rules, variables, mixins and class extensions. This enables developers to write structured, manageable and …\r\n                    "
    },
    "while-loop": {
        "count": 21600,
        "discription": "\r\n                        a control structure used in many programming languages to continuously execute a set of instructions as long as a particular condition is met.\r\n                    "
    },
    "ffmpeg": {
        "count": 21441,
        "discription": "\r\n                        Only questions about programmatic use of the FFmpeg libraries, API, or tools are on topic. Questions about interactive use of the command line tool should be asked on Super User or Video Production.\r\n…\r\n                    "
    },
    "twitter-bootstrap-3": {
        "count": 21336,
        "discription": "\r\n                        the third generation of the front-end framework allowing for speedier web development with an attractive look and feel. Use with the [twitter-bootstrap] tag\r\n                    "
    },
    "command-line": {
        "count": 21325,
        "discription": "\r\n                        a string given to a command interpreter that tells it actions to take, such as running programs or copying files. The interpreter processes command lines with escapes and substitutio…\r\n                    "
    },
    "tfs": {
        "count": 21280,
        "discription": "\r\n                        the on-premises version of Azure DevOps, providing Git and version control hosting, continuous integration, agile planning (issues, Kanban, Scrum, dashboards) and relea…\r\n                    "
    },
    "eloquent": {
        "count": 21231,
        "discription": "\r\n                        The Eloquent ORM included with Laravel provides a beautiful, simple ActiveRecord implementation for working with your database. Each database table has a corresponding \"Model\" which is used to interac…\r\n                    "
    },
    "django-rest-framework": {
        "count": 21207,
        "discription": "\r\n                        A powerful and flexible toolkit for building RESTful Web APIs. Django is a high-level Python Web framework that encourages rapid development and clean, pragmatic design. Built by experienced developer…\r\n                    "
    },
    "server": {
        "count": 21032,
        "discription": "\r\n                        a running instance of a software application capable of accepting requests from a client and giving responses accordingly. \r\n                    "
    },
    "printing": {
        "count": 20989,
        "discription": "\r\n                        a process for reproducing text and images, typically with ink or toner, on paper using a printer, or on screen.\r\n                    "
    },
    "web-applications": {
        "count": 20983,
        "discription": "\r\n                        Do NOT use alone. Do NOT use with web-frameworks or libraries like [reactjs], [django] or [flask].   Use for questions about web applications, where a more specific tag isn't applicable. Use with a ap…\r\n                    "
    },
    "group-by": {
        "count": 20936,
        "discription": "\r\n                        a command in the SQL relational database standard for collapsing a group of rows that share common field value(s) into a single row. Aggregate functions can be performed on other fields in…\r\n                    "
    },
    "shiny": {
        "count": 20929,
        "discription": "\r\n                        an R package that makes it easy to build interactive web applications using only R.\r\n                    "
    },
    "gwt": {
        "count": 20738,
        "discription": "\r\n                        a development toolkit for building and optimizing complex browser-based applications. Its goal is to enable productive development of high-performance web appl…\r\n                    "
    },
    "vuejs2": {
        "count": 20710,
        "discription": "\r\n                        for questions specific to version 2 of Vue.js, an open-source, progressive Javascript framework for building user interfaces.\r\n                    "
    },
    "backbone.js": {
        "count": 20651,
        "discription": "\r\n                        a JavaScript framework with a RESTful JSON interface and is based on the model–view–presenter (MVP) application design paradigm\r\n                    "
    },
    "html-table": {
        "count": 20640,
        "discription": "\r\n                        used to display data in a tabular fashion. Questions regarding HTML tables should be asked by showing the source-code one has problem with, or, if the question is abo…\r\n                    "
    },
    "webview": {
        "count": 20615,
        "discription": "\r\n                        Elements in graphical user interfaces that host HTML content. For Android, look at the android-webview tag. For iOS, look under uiwebview or wkwebview.\r\n                    "
    },
    "tcp": {
        "count": 20599,
        "discription": "\r\n                        a transport layer protocol that provides a connection-oriented data stream service with guaranteed, in-order delivery.\r\n                    "
    },
    "utf-8": {
        "count": 20551,
        "discription": "\r\n                        a character encoding that describes each Unicode code point using a byte sequence of one to four bytes.  It is backwards-compatible with ASCII while still supporting representation of all Uni…\r\n                    "
    },
    "cmake": {
        "count": 20540,
        "discription": "\r\n                        a cross-platform, open-source build system generator. It generates files for build systems like native makefiles, ninja-build and project files for several integrated development environments…\r\n                    "
    },
    "java-8": {
        "count": 20539,
        "discription": "\r\n                        for questions specific to Java 8 which is version 8 (internal number 1.8) of the Java platform, released on 18 March 2014. In most cases, you should also specify the java tag.\r\n                    "
    },
    "merge": {
        "count": 20498,
        "discription": "\r\n                        a generic term for combining two or more related sets of data. It is commonly associated with revision control systems when reconciling multiple changes made to a revision-controlled collec…\r\n                    "
    },
    "zend-framework": {
        "count": 20444,
        "discription": "\r\n                        an open source, object-oriented web application framework implemented in PHP 7.1 and licensed under the New BSD License.\r\n\r\nZend Framework was archived on 1 January 2020 simultaneous…\r\n                    "
    },
    "drop-down-menu": {
        "count": 20281,
        "discription": "\r\n                        A GUI element, similar to a combobox and a list box, which allows the user to choose one value from a list. When a drop-down list is inactive, it displays a single value. When activated, it displays (…\r\n                    "
    },
    "file-io": {
        "count": 20201,
        "discription": "\r\n                        input/output that involves the file system.  This could include performing operations on directories and files, such as creation and deletion, reading files, and writing output to files.\r\n                    "
    },
    "neo4j": {
        "count": 20123,
        "discription": "\r\n                        an open-source graph database (GDB) well suited to connected data. Please mention your exact version of Neo4j when asking questions. You can use it for recommendation engines, fraud detection…\r\n                    "
    },
    "knockout.js": {
        "count": 20060,
        "discription": "\r\n                        an open source JavaScript library for dynamic HTML UIs using the Model-View-View Model (MVVM) pattern.\r\n                    "
    },
    "view": {
        "count": 19865,
        "discription": "\r\n                        for questions about database view or UI / architectural view. See also the following tags: sql-view, android-view, uiview.\r\n                    "
    },
    "uwp": {
        "count": 19850,
        "discription": "\r\n                        a common software platform for all devices running Windows 10, including Desktop. This tag should be used for questions regarding developing UWP applications on any o…\r\n                    "
    },
    "terminal": {
        "count": 19848,
        "discription": "\r\n                        a text-only interface for interacting with an operating system or a piece of software. A user typically types commands into the terminal to perform specific tas…\r\n                    "
    },
    "redis": {
        "count": 19803,
        "discription": "\r\n                        an open source (BSD licensed), in-memory data structure store, used as a database, cache and message broker. It supports data structures such as strings, hashes, lists, sets, sorted sets with…\r\n                    "
    },
    "split": {
        "count": 19799,
        "discription": "\r\n                        for questions about separating an item (e.g. a string) into parts, often by a delimiter or regular expression.\r\n                    "
    },
    "drupal": {
        "count": 19789,
        "discription": "\r\n                        an open source CMS framework written in PHP.\r\n\r\n*IMPORTANT* Rather than using this tag, consider posting your question directly on https://drupal.stackexchange.com/.\r\nAlso, because of substa…\r\n                    "
    },
    "deep-learning": {
        "count": 19765,
        "discription": "\r\n                        an area of machine learning whose goal is to learn complex functions using special neural network architectures that are \"deep\"  (consist of many layers). This tag should be used for …\r\n                    "
    },
    "scroll": {
        "count": 19764,
        "discription": "\r\n                        Scrolling refers to the continuous sliding of content across a display screen.\r\n                    "
    },
    "windows-phone-7": {
        "count": 19753,
        "discription": "\r\n                        Microsoft's, now deprecated, mobile operating system and software development platform. Use this tag for questions specific to Version 7.x\r\n\r\n\r\n                    "
    },
    "datatable": {
        "count": 19716,
        "discription": "\r\n                        ambiguous. In .NET, it's a class that represents a table of in-memory data. In component based MVC frameworks like JSF and Wicket, it's an UI component that dynamically renders…\r\n                    "
    },
    "build": {
        "count": 19708,
        "discription": "\r\n                        The process of converting source code files into standalone software artifact(s) that can be run on a computer\r\n                    "
    },
    "visual-studio-2015": {
        "count": 19620,
        "discription": "\r\n                        the version of Microsoft's Visual Studio product suite which follows 2013 version (also known as \"Dev14\", includes C++ compiler version 19.0).  Use this tag if you have a specifi…\r\n                    "
    },
    "hive": {
        "count": 19589,
        "discription": "\r\n                        a database built on top of Hadoop and facilitates easy data summarization, ad-hoc queries, and the analysis of large datasets stored in Hadoop compatible distributed file system. Hive provides…\r\n                    "
    },
    "concurrency": {
        "count": 19560,
        "discription": "\r\n                        a property of systems in which multiple computations can be performed in overlapping time periods. The computations may be executing on multiple cores in the same c…\r\n                    "
    },
    "aws-lambda": {
        "count": 19532,
        "discription": "\r\n                        a compute service that lets you run code without the overhead of managing servers. (Not to be confused with the [lambda] tag, which instead refers to a type of function).\r\n                    "
    },
    "solr": {
        "count": 19520,
        "discription": "\r\n                        an open source search server based on the Lucene Java search library.\r\n                    "
    },
    "parse-platform": {
        "count": 19502,
        "discription": "\r\n                        Parse-Platform provides an open source backend for powering end-user applications. Parse supports a number of different platforms, including iOS (7.0+), OS X (10.9+), Android (API level 9+), Unity 5, …\r\n                    "
    },
    "rust": {
        "count": 19478,
        "discription": "\r\n                        a systems programming language without a garbage collector focused on three goals: safety, speed, and concurrency. Use this tag for questions about code written in Rust. Use a edition specific…\r\n                    "
    },
    "paypal": {
        "count": 19381,
        "discription": "\r\n                        For questions about the PayPal API used by software developers to process payments, manage invoices, monitor accounts, etc. (For user-level support, contact PayPal directly using their site.)\r\n                    "
    },
    "syntax": {
        "count": 19219,
        "discription": "\r\n                        Syntax refers to the actual language elements and symbols themselves. Questions should be tagged as syntax when the question specifically and almost completely relates to syntax alone. This tag should…\r\n                    "
    },
    "datagridview": {
        "count": 19152,
        "discription": "\r\n                        a Windows Forms control used to display and edit tabular data.\r\n                    "
    },
    "enums": {
        "count": 19135,
        "discription": "\r\n                        A data type consisting of a set of named values called elements, members or enumerators of the type.\r\n                    "
    },
    "oracle11g": {
        "count": 19047,
        "discription": "\r\n                        an Object-relational Database Management System (ORDBMS) created by Oracle Corporation. Specific releases of the product are known as Oracle9i, Oracle10g, Oracle 11g and Oracle 12c, where \"i…\r\n                    "
    },
    "ssis": {
        "count": 19031,
        "discription": "\r\n                        SSIS (Microsoft SQL Server Integration Services) is a platform for building enterprise-level data integration and data transformations solutions. SSIS is used to perform ETL operations; i.e. extract, …\r\n                    "
    },
    "module": {
        "count": 19017,
        "discription": "\r\n                        A logical subdivision of a larger, more complex system.\r\n                    "
    },
    "google-analytics": {
        "count": 18996,
        "discription": "\r\n                        a free web analytics solution provided by Google, featuring several client-side APIs, as well as REST APIs for data export and for management.\r\n                    "
    },
    "parameters": {
        "count": 18980,
        "discription": "\r\n                        a type of variable used in a subroutine to refer to the data provided as input to the subroutine.\r\n                    "
    },
    "visual-studio-2013": {
        "count": 18871,
        "discription": "\r\n                        a version of Microsoft's Visual Studio (also known as \"Dev12\", includes C++ compiler version 18.0). Do not use this tag unless you have a specific question about Visual Studio --…\r\n                    "
    },
    "promise": {
        "count": 18816,
        "discription": "\r\n                        a tactic for deferred computing, suitable for several styles of concurrency: thread and event loop concurrency for local computation, and both synchronous and asynchronous remote messagin…\r\n                    "
    },
    "fonts": {
        "count": 18798,
        "discription": "\r\n                        an electronic data file containing a set of glyphs, characters, or symbols such as dingbats. Although the term font first referred to a set of metal type sorts in one style and size, since t…\r\n                    "
    },
    "graphics": {
        "count": 18787,
        "discription": "\r\n                        visual presentations. Questions using this tag should also be tagged with the appropriate language and graphics subsystem in use. For more general graphics questions, consider Computer Gr…\r\n                    "
    },
    "nhibernate": {
        "count": 18769,
        "discription": "\r\n                        an open source object-relational mapper (ORM) for the .NET framework.\r\n\r\n                    "
    },
    "colors": {
        "count": 18734,
        "discription": "\r\n                        for questions about representing or manipulating colors in a programming language.\r\n                    "
    },
    "oauth-2.0": {
        "count": 18697,
        "discription": "\r\n                        an open protocol framework to allow secure API authorization in a simple and standardized way for desktop, mobile and web applications.\r\n\r\nOAuth 2.0 is the second version…\r\n                    "
    },
    "primefaces": {
        "count": 18691,
        "discription": "\r\n                        a JSF (Java Server Faces) component library that ships with a large set of rich components which utilizes jQuery and jQuery UI under the covers. It supports the jQuery UI ThemeRoller CSS…\r\n                    "
    },
    "constructor": {
        "count": 18636,
        "discription": "\r\n                        A special type of subroutine called at the creation of an object.\r\n                    "
    },
    "outlook": {
        "count": 18630,
        "discription": "\r\n                        a personal information manager from Microsoft (most notably used for handling e-mail), available both as a separate application as well as a part of the Microsoft Office suite.\r\n                    "
    },
    "async-await": {
        "count": 18523,
        "discription": "\r\n                        This covers the asynchronous programming model supported by various programming languages, using the async and await keywords.\r\n                    "
    },
    "oauth": {
        "count": 18465,
        "discription": "\r\n                        a specification for client applications to access protected resources on behalf of a user. It was developed as an alternative to users handing out their login credentials…\r\n                    "
    },
    "memory-leaks": {
        "count": 18459,
        "discription": "\r\n                        A memory leak occurs when a program fails to release memory that it has allocated but is no longer using and is not recoverable.\r\n                    "
    },
    "login": {
        "count": 18433,
        "discription": "\r\n                        A login or logon (also called logging in or on and signing in or on) is the process by which individual access to a computer system is controlled by identification of the user using credentials provid…\r\n                    "
    },
    "sql-server-2005": {
        "count": 18416,
        "discription": "\r\n                        for questions specific to the 2005 version of Microsoft's SQL Server.\r\n                    "
    },
    "docker-compose": {
        "count": 18415,
        "discription": "\r\n                        a tool for defining and running complex applications with Docker. With Compose, you define a multi-container application in a single file, then spin your application up in a single command …\r\n                    "
    },
    "swift3": {
        "count": 18389,
        "discription": "\r\n                        only for questions directly related to changes in version 3 of Apple's Swift programming language. Use the tag [swift] for more general language questions, or the tags [ios], [cocoa], [ap…\r\n                    "
    },
    "uiview": {
        "count": 18368,
        "discription": "\r\n                        a class in the UIKit framework of iOS defines a rectangular area on the screen and the interfaces for managing the content in that area. All UI elements are either subclasses of UIView or ar…\r\n                    "
    },
    "windows-phone-8": {
        "count": 18333,
        "discription": "\r\n                        a version of Windows Phone (Oct 29, 2012 - present) that succeeds Windows Phone 7.5 and includes many new features.\r\n                    "
    },
    "automation": {
        "count": 18329,
        "discription": "\r\n                        the process of having a computer do a repetitive task or a task that requires great precision or multiple steps, without requiring human intervention.\r\n                    "
    },
    "azure-devops": {
        "count": 18231,
        "discription": "\r\n                        a suite of 5 services you use together or independently. For example, Azure Pipelines provides build services (CI) as well as release management for continuous delivery (CD) to any clo…\r\n                    "
    },
    "count": {
        "count": 18132,
        "discription": "\r\n                        Count refers to the number of objects in a collection. It's also a commonly-used SQL function that counts the number of rows.\r\n                    "
    },
    "vbscript": {
        "count": 18118,
        "discription": "\r\n                        VBScript (Visual Basic Scripting Edition) is an interpreted scripting language developed by Microsoft that is modeled on Visual Basic.\r\n\r\nVBScript is not the same thing as VBA or VB.NET.  They are thr…\r\n                    "
    },
    "timer": {
        "count": 18073,
        "discription": "\r\n                        a component that has the functionality to trigger a user defined action at regular intervals as configured by the user. \r\n                    "
    },
    "lua": {
        "count": 17930,
        "discription": "\r\n                        a powerful, fast, lightweight, embeddable scripting language. It is dynamically typed, runs by interpreting bytecode, and has automatic garbage collection. Its speed is one of the main reasons …\r\n                    "
    },
    "parallel-processing": {
        "count": 17921,
        "discription": "\r\n                        Parallel processing is, in sharp contrast to just a Concurrent processing, guaranteed to start / perform / finish all thread-level and/or instruction-level tasks executed in a parallel fashion and pro…\r\n                    "
    },
    "interface": {
        "count": 17827,
        "discription": "\r\n                        An interface refers to the designated point of interaction with a component. Interfaces are applicable at both the hardware and software level.\r\n\r\n---\r\n\r\nIt also refers to the language-element `interf…\r\n                    "
    },
    "cassandra": {
        "count": 17799,
        "discription": "\r\n                        a highly scalable, eventually consistent, distributed, structured row/column store.\r\n                    "
    },
    "ms-word": {
        "count": 17788,
        "discription": "\r\n                        For programming questions related to Microsoft's \"Word\" editor.\r\n\r\nQuestions on general usage of the editor are off-topic for Stack Overflow; they should be asked on Super User instead.\r\n                    "
    },
    "socket.io": {
        "count": 17644,
        "discription": "\r\n                        Socket.IO aims to make realtime apps possible in every browser and mobile device, blurring the differences between the different transport mechanisms. It supports multiple transports, such as WebSocke…\r\n                    "
    },
    "casting": {
        "count": 17638,
        "discription": "\r\n                        a process where an object type is explicitly converted into another type if the conversion is allowed. This process might lead to a change in value.\r\n                    "
    },
    "jar": {
        "count": 17619,
        "discription": "\r\n                        JAR file (or Java ARchive) aggregates many files into one. JAR files build on the ZIP file format.\r\n                    "
    },
    "proxy": {
        "count": 17553,
        "discription": "\r\n                        a device or program that stands between two or more interconnected programs or devices. Use [dynamic-proxy] for the Java class and [proxy-pattern] for the design pattern.\r\n                    "
    },
    "orm": {
        "count": 17465,
        "discription": "\r\n                        a technique for mapping object-oriented systems to relational databases. Use other tags to indicate the programming language ([java], [sql], [python]), database syst…\r\n                    "
    },
    "angularjs-directive": {
        "count": 17449,
        "discription": "\r\n                        a way to teach HTML new tricks by extending the HTML vocabulary. Directives allow you to manage DOM elements in a declarative pattern, freeing you from low level DOM manipulat…\r\n                    "
    },
    "sqlalchemy": {
        "count": 17443,
        "discription": "\r\n                        a Python SQL toolkit and Object Relational Mapper that gives application developers the full power and flexibility of SQL.\r\n                    "
    },
    "push-notification": {
        "count": 17362,
        "discription": "\r\n                        alerts, badges, or sounds which are pushed to a mobile device from a remote server.\r\n\r\nApple delivers push notifications via the Apple Push Notification Service (APNS). Android …\r\n                    "
    },
    "rspec": {
        "count": 17348,
        "discription": "\r\n                        a behavior-driven development (BDD) framework for the Ruby programming language, inspired by JBehave. It contains its own fully integrated mocking framework based upon JMock. The framework ca…\r\n                    "
    },
    "react-redux": {
        "count": 17313,
        "discription": "\r\n                        Official React bindings for Redux\r\n                    "
    },
    "neural-network": {
        "count": 17297,
        "discription": "\r\n                        Network structure inspired by simplified models of biological neurons (brain cells).  Neural networks are trained to \"learn\" by supervised and unsupervised techniques, and can be used to solve optimiz…\r\n                    "
    },
    "scipy": {
        "count": 17297,
        "discription": "\r\n                        an open source library of algorithms and mathematical tools for the Python programming language.\r\n                    "
    },
    "datatables": {
        "count": 17249,
        "discription": "\r\n                        a plug-in for the jQuery JavaScript library. It is a highly flexible tool, based upon the foundations of progressive enhancement, which will add advanced interaction controls to any HTML…\r\n                    "
    },
    "directory": {
        "count": 17205,
        "discription": "\r\n                        a virtual container within a digital file system, in which groups of computer files and other directories can be kept and organized.\r\n                    "
    },
    "compiler-errors": {
        "count": 17172,
        "discription": "\r\n                        generated during the compilation phase, often due to problems with invalid syntax and/or types.  Compare to [runtime-error].\r\n                    "
    },
    "hyperlink": {
        "count": 17076,
        "discription": "\r\n                        a reference to a document (or a section) that can be followed for retrieval using a navigation system that allows selecting emphasized content within an originating document.\r\n                    "
    },
    "arduino": {
        "count": 17034,
        "discription": "\r\n                        ARDUINO QUESTIONS MUST BE PROGRAMMING RELATED. Arduino is an open-source electronics prototyping platform based on easy-to-use hardware and software. Questions should relate to programming Arduinos on…\r\n                    "
    },
    "emacs": {
        "count": 16989,
        "discription": "\r\n                        an extensible, customizable, self-documenting text editor, which can be extended with Lisp code.  Although Emacs is a general-purpose editor, questions may be on-topic here if they are ab…\r\n                    "
    },
    "combobox": {
        "count": 16987,
        "discription": "\r\n                        Combobox allows to select one option out of several (similar to a dropdownlist), or to type a custom option. \r\n                    "
    },
    "playframework": {
        "count": 16970,
        "discription": "\r\n                        a modern open-source web framework for Java and Scala.\r\n                    "
    },
    "three.js": {
        "count": 16933,
        "discription": "\r\n                        a lightweight cross-browser JavaScript library/API used to create and display animated 3D computer graphics on a Web browser. Three.js scripts may be used in conjunction with the HTML5 can…\r\n                    "
    },
    "triggers": {
        "count": 16777,
        "discription": "\r\n                        rules that perform actions or invoke functions in response to events such as matching conditions or database changes. Use with an applicable database, platform, product, or service tag wh…\r\n                    "
    },
    "google-api": {
        "count": 16738,
        "discription": "\r\n                        Use for questions about various Google APIs. The APIs are usually based on popular Google consumer products, including Cloud Platform, Google Maps, Google Earth, AdSense, Adwords, Google Apps, and You…\r\n                    "
    },
    "linked-list": {
        "count": 16726,
        "discription": "\r\n                        a data structure where the list elements are not necessarily stored sequentially but rather each element contains a reference to the next (and optionally the previous) element in the …\r\n                    "
    },
    "django-views": {
        "count": 16719,
        "discription": "\r\n                        MVC views; they control rendering (typically through templates), and the data displayed.\r\n                    "
    },
    "model": {
        "count": 16719,
        "discription": "\r\n                        Part of the MVC pattern, the Model manages the behaviour and data of the application. \r\n                    "
    },
    "properties": {
        "count": 16683,
        "discription": "\r\n                        A property, in some object-oriented programming languages, is a special sort of class member, intermediate between a field (or data member) and a method. Properties are read and written like fields, b…\r\n                    "
    },
    "clojure": {
        "count": 16660,
        "discription": "\r\n                        a modern Lisp dialect for the Java Virtual Machine (with versions for the CLR and JavaScript). More than merely an implementation of Lisp in Java, Clojure provides access to Java's classes …\r\n                    "
    },
    "yii": {
        "count": 16641,
        "discription": "\r\n                        Use for questions about any version of Yii, an open-source MVC framework for writing web 2.0 applications in PHP5+\r\n                    "
    },
    "xamarin.android": {
        "count": 16624,
        "discription": "\r\n                        Xamarin.Android (previously known as Mono for Android) is an implementation of Mono that runs on the Android platform, allowing you to write Android applications in C# using native Android libraries a…\r\n                    "
    },
    "download": {
        "count": 16606,
        "discription": "\r\n                        Receiving data to a local system from a remote system, or to initiate such a data transfer. Do not use this tag for question asking where to download off-site resource.\r\n                    "
    },
    "pip": {
        "count": 16603,
        "discription": "\r\n                        Use for questions about the Python package installer\r\n                    "
    },
    "process": {
        "count": 16598,
        "discription": "\r\n                        about operating system processes. It may also refer to a specific construct on a given platform, e.g., the System.Diagnostics.Process class for .NET\r\n                    "
    },
    "flexbox": {
        "count": 16536,
        "discription": "\r\n                        CSS module for flexible layouts providing a broad range of options for aligning elements while eliminating the need for floats and tables.\r\n                    "
    },
    "doctrine-orm": {
        "count": 16515,
        "discription": "\r\n                        a PHP ORM. While Doctrine 1.2 uses the Active Record pattern, Doctrine ORM 2 and up uses the Data Mapper pattern. The Doctrine project is a collection of open source libraries and tool…\r\n                    "
    },
    "functional-programming": {
        "count": 16511,
        "discription": "\r\n                        a programming paradigm based upon building abstractions using functions, avoiding side effects and change of state. Pure functional programming is thread-safe.\r\n                    "
    },
    "sql-server-2012": {
        "count": 16476,
        "discription": "\r\n                        for questions specific to the 2012 version of Microsoft's SQL Server.\r\n                    "
    },
    "django-forms": {
        "count": 16473,
        "discription": "\r\n                        Specific questions related to forms with the Django web framework\r\n                    "
    },
    "configuration": {
        "count": 16419,
        "discription": "\r\n                        the process of specifying the settings used for a system or application\r\n                    "
    },
    "path": {
        "count": 16286,
        "discription": "\r\n                        The general form of a file or directory name that specifies a unique location in a file system.  In many Linux and Unix-like OS the PATH (all upper case) variable specifies the directories where execu…\r\n                    "
    },
    "callback": {
        "count": 16244,
        "discription": "\r\n                        a piece of code (i.e. the address or reference of a function or method or a lambda expression) that is passed as an argument to other code, which is expected to call back (execute) the a…\r\n                    "
    },
    "kendo-ui": {
        "count": 16160,
        "discription": "\r\n                        a framework to build HTML UI. It delivers everything needed for client-side, jQuery-powered development in one integrated, compact package, complete with AngularJS integration.\r\n                    "
    },
    "version-control": {
        "count": 16075,
        "discription": "\r\n                        the management of changes to documents, programs, and other information stored as computer files. Use this tag to mark general questions about usage and applicability of version con…\r\n                    "
    },
    "safari": {
        "count": 16063,
        "discription": "\r\n                        Apple's web browser, the default browser on macOS and iOS.\r\n                    "
    },
    "uiviewcontroller": {
        "count": 16053,
        "discription": "\r\n                        The UIViewController class manages the views in iOS apps and mediates the interaction between an app's views, its underlying model objects, and the overall workflow.\r\n                    "
    },
    "io": {
        "count": 16040,
        "discription": "\r\n                        In computing, input/output, or I/O, refers to the communication between an information processing system (such as a computer), and the outside world, possibly a human, or another information processin…\r\n                    "
    },
    "binding": {
        "count": 15998,
        "discription": "\r\n                        means different things in different contexts; consider using less ambiguous tags instead or in addition. Common meanings include: Dependency-Injection and  Data Binding to Objects and Binding…\r\n                    "
    },
    "scope": {
        "count": 15902,
        "discription": "\r\n                        an enclosing context where values and expressions are associated. Use this tag for questions about different types of scope as well for questions where scope may be unclear.\r\n                    "
    },
    "ansible": {
        "count": 15900,
        "discription": "\r\n                        a model-driven configuration management, multi-node deployment/orchestration and remote task execution system. It uses SSH by default, so there is no special software to be installe…\r\n                    "
    },
    "jsf-2": {
        "count": 15896,
        "discription": "\r\n                        a model-view-presenter framework typically used to create web applications. Version 2.x is a major step ahead compared to JSF 1.x, significantly expanding the standard set of…\r\n                    "
    },
    "spring-data-jpa": {
        "count": 15857,
        "discription": "\r\n                        part of the Spring Data umbrella project which makes it easy to implement JPA based repositories\r\n                    "
    },
    "scripting": {
        "count": 15834,
        "discription": "\r\n                        a form of programming generally characterized by low formality, loose typing, and no requirement for explicit compilation. There are numerous scripting languages, and these are used in a …\r\n                    "
    },
    "apache-spark-sql": {
        "count": 15833,
        "discription": "\r\n                        a tool for \"SQL and structured data processing\" on Spark, a fast and general-purpose cluster computing system. It can be used to retrieve data from Hive, Parquet etc. and run SQL q…\r\n                    "
    },
    "routes": {
        "count": 15717,
        "discription": "\r\n                        Questions about mapping URLs to Controllers and Actions.\r\n                    "
    },
    "visual-studio-2008": {
        "count": 15715,
        "discription": "\r\n                        refers to the Visual Studio line of software development products from Microsoft, the 2008 version. Do not use this tag unless you have a specific question about Visual Studio -- not just a c…\r\n                    "
    },
    "dns": {
        "count": 15707,
        "discription": "\r\n                        DNS QUESTIONS MUST BE PROGRAMMING RELATED. Use this tag for programming questions related to writing code that interacts with the Domain Name System (DNS); for example, writing code that uses gethostb…\r\n                    "
    },
    "responsive-design": {
        "count": 15706,
        "discription": "\r\n                        an approach to Web design and development that aims at crafting sites to provide optimal experiences across a wide range of devices based on screen size, platform, and o…\r\n                    "
    },
    "bluetooth": {
        "count": 15686,
        "discription": "\r\n                        a global open wireless technology standard for exchanging data over short distances (using short wavelength radio transmissions) from fixed and mobile devices, creating personal area netw…\r\n                    "
    },
    "rxjs": {
        "count": 15683,
        "discription": "\r\n                        The Reactive Extensions for JavaScript (RxJS) is a set of libraries for composing asynchronous and event-based programs using observable collections and Array Extras style composition.\r\n\r\n\r\n                    "
    },
    "url-rewriting": {
        "count": 15648,
        "discription": "\r\n                        software that modifies a web URL's appearance (URL rewriting). Rewritten URLs are used to provide shorter and more relevant-looking links to web pages, to route users from obso…\r\n                    "
    },
    "cron": {
        "count": 15592,
        "discription": "\r\n                        a time-based job scheduler running as a daemon process in Unix-like computer operating systems.\r\n                    "
    },
    "android-listview": {
        "count": 15535,
        "discription": "\r\n                        a subclass of AdapterView which shows items in a vertically scrolling list.\r\n                    "
    },
    "autocomplete": {
        "count": 15527,
        "discription": "\r\n                        a UI feature provided by applications, where the program predicts a word or phrase that the user wants to type without the user actually typing it completely.\r\n                    "
    },
    "asp.net-mvc-5": {
        "count": 15498,
        "discription": "\r\n                        the fifth major version of the ASP.NET Model-View-Controller platform for web applications.\r\n                    "
    },
    "pagination": {
        "count": 15458,
        "discription": "\r\n                        the process of dividing information into discrete pages.\r\n                    "
    },
    "compilation": {
        "count": 15436,
        "discription": "\r\n                        the transformation of source text into some other form or representation. The most common usage of this tag is for questions concerning transformation of a programming language into mac…\r\n                    "
    },
    "permissions": {
        "count": 15400,
        "discription": "\r\n                        Permissions define the operations that authenticated users are allowed to perform on file systems, databases and other computer systems.\r\n                    "
    },
    "phpmyadmin": {
        "count": 15385,
        "discription": "\r\n                        an open-source, web-based MySQL administration tool written in PHP. Use this tag for problems related to using this tool and not for general query problems\r\n                    "
    },
    "nullpointerexception": {
        "count": 15383,
        "discription": "\r\n                        The Java exception thrown when an application attempts to use null in a case where an object is required. \r\n                    "
    },
    "architecture": {
        "count": 15382,
        "discription": "\r\n                        Architecture encompasses the process, artifacts and high-level structure of a solution.\r\n                    "
    },
    "datepicker": {
        "count": 15381,
        "discription": "\r\n                        a user interface element in many frameworks that allows a user to choose a date and also, in some cases, time, often through a visual calendar.\r\n                    "
    },
    "reference": {
        "count": 15333,
        "discription": "\r\n                        a value that enables a program to indirectly access a particular datum, such as a variable or a record, in the computer's memory or in some other storage device. \r\n                    "
    },
    "f#": {
        "count": 15309,
        "discription": "\r\n                        a succinct, expressive and efficient functional and object-oriented language for .NET which helps you write simple code to solve complex problems.\r\n                    "
    },
    "django-templates": {
        "count": 15307,
        "discription": "\r\n                        Questions about the template engine of Django, which is intended to separate the presentation of a document from its data.\r\n                    "
    },
    "google-bigquery": {
        "count": 15300,
        "discription": "\r\n                        a Google Cloud Platform product providing serverless queries of petabyte-scale data sets using SQL. BigQuery provides multiple read-write pipelines, and enables data analytics that …\r\n                    "
    },
    "xamarin.ios": {
        "count": 15276,
        "discription": "\r\n                        Xamarin.iOS (previously known as MonoTouch) is a commercial software development kit for Mac OS X and Windows that lets you use C# (a .NET programming language) to create native applications for Apple…\r\n                    "
    },
    "pygame": {
        "count": 15258,
        "discription": "\r\n                        a set of Python modules designed for writing video games. \r\n\r\nUse this tag only if you are using the Pygame library and not if you have a question about programming a game in Python in gener…\r\n                    "
    },
    "firebase-authentication": {
        "count": 15237,
        "discription": "\r\n                        Firebase Authentication provides backend services, easy-to-use SDKs, and ready-made UI libraries to authenticate users to your app.\r\n                    "
    },
    "linux-kernel": {
        "count": 15235,
        "discription": "\r\n                        for questions about the internals of the Linux kernel itself - particularly about writing code that runs within the context of the kernel (like kernel modules or drivers).\r\n\r\nQuestions abo…\r\n                    "
    },
    "3d": {
        "count": 15231,
        "discription": "\r\n                        graphics that use a three-dimensional representation of geometric data stored in the computer for the purposes of performing calculations and rendering 2D images.\r\n                    "
    },
    "get": {
        "count": 15228,
        "discription": "\r\n                        one of many request methods supported by the HTTP protocol. The GET request method is used when the client needs to get data from the server as part of the request-URI. \r\n\r\n                    "
    },
    "python-requests": {
        "count": 15172,
        "discription": "\r\n                        USE ONLY FOR THE PYTHON REQUESTS LIBRARY. Requests is a full-featured Python HTTP library with an easy-to-use, logical API.\r\n                    "
    },
    "bitmap": {
        "count": 15167,
        "discription": "\r\n                        Data structure for encoding pictures as a set of bits, in which each image pixel is mapped to a bit or a group of bit.  Also used for encoding other complex data where each elementary information is m…\r\n                    "
    },
    "ant": {
        "count": 15152,
        "discription": "\r\n                        a declarative, XML-based build tool created originally for Java projects.  It provides a rich set of standard tasks for performing most common build operations, su…\r\n                    "
    },
    "nlp": {
        "count": 15135,
        "discription": "\r\n                        a subfield of artificial intelligence that involves transforming or extracting useful information from natural language data. Methods include machine-learning and …\r\n                    "
    },
    "joomla": {
        "count": 15119,
        "discription": "\r\n                        a free and open source Content Management System (CMS) for publishing content on the World Wide Web and intranets and a model–view–controller (MVC) Web application framework that can also b…\r\n                    "
    },
    "controller": {
        "count": 15037,
        "discription": "\r\n                        responsible for executing a sequence of instructions in response to some stimulus (maybe a command, action, or event). This is often used in conjunction with the Spring or model-view-c…\r\n                    "
    },
    "static": {
        "count": 15021,
        "discription": "\r\n                        a term used in some programming languages to define a function or data storage area (field) that is not bound to any specific object instance.  In the majority of cases this tag, if used, sh…\r\n                    "
    },
    "jupyter-notebook": {
        "count": 15008,
        "discription": "\r\n                        a web application that provides a frontend to many different languages and interactive shells such as IPython. Jupyter Notebook, unlike its predecessor IPython Notebook, suppor…\r\n                    "
    },
    "webforms": {
        "count": 15000,
        "discription": "\r\n                        a part of the ASP.NET web framework. It is one of the programming models you can use to create web applications. Web Forms are pages that users request through their browsers and that for…\r\n                    "
    },
    "scrapy": {
        "count": 14994,
        "discription": "\r\n                        a fast open-source high-level screen scraping and web crawling framework written in Python used to crawl websites and extract structured data from their pages. It can be used for a wide rang…\r\n                    "
    },
    "datagrid": {
        "count": 14970,
        "discription": "\r\n                        A graphical user interface element that presents a tabular view of data.\r\n                    "
    },
    "menu": {
        "count": 14911,
        "discription": "\r\n                        a user interface mechanism that provides the user a means to view and execute application operations. (Generic; please use platform and/or language tags when possible instead)\r\n                    "
    },
    "tree": {
        "count": 14845,
        "discription": "\r\n                        a widely-used data structure that emulates a hierarchical tree-like structure with a set of linked nodes.\r\n                    "
    },
    "angular-material": {
        "count": 14832,
        "discription": "\r\n                        an implementation of Material Design in Angular. Do not use this tag for AngularJS Material, the implementation of Material Design for the older AngularJS framework.\r\n                    "
    },
    "ios7": {
        "count": 14797,
        "discription": "\r\n                        the seventh version of Apple's iOS mobile operating system and is the successor to iOS 6. It was announced at the company's Apple Worldwide Developers Conference (WWDC) on June 10, 2013, and …\r\n                    "
    },
    "pyqt": {
        "count": 14745,
        "discription": "\r\n                        a set of Python v2 and v3 bindings for The Qt Company's Qt application framework and runs on all platforms supported by Qt including Windows, macOS, Linux, iOS and Android\r\n                    "
    },
    "jmeter": {
        "count": 14735,
        "discription": "\r\n                        an open source Java application, designed to load-test functional behavior and measure performance. Originally designed for testing Web Applications, it has since expanded to other te…\r\n                    "
    },
    "youtube": {
        "count": 14718,
        "discription": "\r\n                        a video-sharing website on which users can upload, share, and view videos. StackOverflow questions tagged with \"youtube\" should be about specific programming problems, software tools, or li…\r\n                    "
    },
    "notifications": {
        "count": 14688,
        "discription": "\r\n                        a user interface element displayed to indicate an event has occurred.\r\n                    "
    },
    "linq-to-sql": {
        "count": 14655,
        "discription": "\r\n                        a component of .NET Framework version 3.5 that provides a run-time infrastructure for managing relational data as objects stored in Microsoft SQL Server.\r\n                    "
    },
    "react-router": {
        "count": 14616,
        "discription": "\r\n                        React Router - A complete routing library for React inspired by Ember's routing system\r\n                    "
    },
    "request": {
        "count": 14612,
        "discription": "\r\n                        a message sent by a source to another object.\r\n                    "
    },
    "jboss": {
        "count": 14602,
        "discription": "\r\n                        a free software/open-source Java EE-based, Cross-platform Application Server.\r\n                    "
    },
    "yii2": {
        "count": 14568,
        "discription": "\r\n                        the latest version of the Yii framework - a high-performance, component-based PHP framework\r\n                    "
    },
    "transactions": {
        "count": 14535,
        "discription": "\r\n                        A set of interrelated operations that must all succeed in order for any of them to succeed.  Failure of any operation results in a rollback of all operations in the transaction.\r\n                    "
    },
    "raspberry-pi": {
        "count": 14533,
        "discription": "\r\n                        a small, inexpensive ARM-based PC device. PROGRAMMING QUESTIONS ONLY. Questions about using it should be asked on https://raspberrypi.stackexchange.com/\r\n                    "
    },
    "devise": {
        "count": 14533,
        "discription": "\r\n                        an authentication gem for Ruby-on-Rails. It supersedes previous solutions such as Restful Authentication or Authlogic.\r\n                    "
    },
    "android-asynctask": {
        "count": 14532,
        "discription": "\r\n                        Use for questions on android.os.AsyncTask\r\n                    "
    },
    "laravel-4": {
        "count": 14471,
        "discription": "\r\n                        the previous version of the open-source PHP web development MVC framework created by Taylor Otwell. Laravel helps you create applications using simple, expressive syntax.\r\n                    "
    },
    "grep": {
        "count": 14462,
        "discription": "\r\n                        a command-line text-search utility originally written for Unix. It uses regular expressions to match text, and is commonly used as a filter in pipelines.  Use this tag only if your question re…\r\n                    "
    },
    "exception-handling": {
        "count": 14399,
        "discription": "\r\n                        a programming language construct or computer hardware mechanism designed to handle the occurrence of exceptions, special conditions that change the normal flow of program executi…\r\n                    "
    },
    "stl": {
        "count": 14356,
        "discription": "\r\n                        a C++ library of generic containers, iterators, algorithms, and function objects.\r\n\r\nWhen C++ was standardised, large parts of the STL were adopted into the S…\r\n                    "
    },
    "routing": {
        "count": 14298,
        "discription": "\r\n                        the process of selecting paths in a network along which to send network traffic.\r\n\r\nFor the process of associating URLs to content, use the tag url-routing instead.\r\n                    "
    },
    "x86": {
        "count": 14271,
        "discription": "\r\n                        an architecture derived from the Intel 8086 CPU. The x86 family includes the 32-bit IA-32 and 64-bit x86-64 architectures, as well as legacy 16-bit architectures. Questions about the latter sho…\r\n                    "
    },
    "null": {
        "count": 14235,
        "discription": "\r\n                        Null means *nothing* or *unknown*, depending on context.\r\nPlease use the \"sql-null\" tag for SQL specific questions.\r\n\r\n                    "
    },
    "active-directory": {
        "count": 14193,
        "discription": "\r\n                        a distributed directory service created by Microsoft. It stores all information and settings for a deployment in a central database. AD allows administrators to assign policie…\r\n                    "
    },
    "character-encoding": {
        "count": 14092,
        "discription": "\r\n                        Character encoding refers to the way characters are represented as a series of bytes. Character encoding for the Web is defined in the Encoding Standard.\r\n                    "
    },
    "jackson": {
        "count": 13944,
        "discription": "\r\n                        a Java library for handling tasks like reading and writing (parsing / generating) and data binding to/from Java objects. Although primarily used for JSON, Jackson also supports many other d…\r\n                    "
    },
    "opengl-es": {
        "count": 13777,
        "discription": "\r\n                        Subset of the OpenGL 3D graphics API designed for embedded devices such as mobile phones.\r\n                    "
    },
    "stream": {
        "count": 13774,
        "discription": "\r\n                        DO NOT USE FOR THE JAVA STREAM API (use [java-stream] for those questions!) \r\n\r\nA stream is a series of data elements which can be accessed in a serial fashion.\r\n\r\n                    "
    },
    "background": {
        "count": 13720,
        "discription": "\r\n                        Background typically refers to the rendering behind a container element's contents - usually on a web page, Windows form or other UI presentation medium.\r\n                    "
    },
    "axios": {
        "count": 13610,
        "discription": "\r\n                        a Promise-based HTTP client for JavaScript which can be used in your front-end application and in your Node.js backend.\r\n                    "
    },
    "openssl": {
        "count": 13608,
        "discription": "\r\n                        an open source software toolkit that implements the SSL/TLS protocol, as well as a general cryptographic library.\r\n                    "
    },
    "swiftui": {
        "count": 13607,
        "discription": "\r\n                        Apple's declarative Swift API for defining graphical user interfaces. Use this tag for questions about SwiftUI on any platform.\r\n                    "
    },
    "msbuild": {
        "count": 13583,
        "discription": "\r\n                        Microsoft Build Engine, also known as MSBuild, is a build platform for managed code and was part of .NET Framework. \r\n                    "
    },
    "ftp": {
        "count": 13567,
        "discription": "\r\n                        a well-established protocol for conducting file operations (such as transferring files) over a TCP-based network such as the Internet.\r\n                    "
    },
    "coldfusion": {
        "count": 13534,
        "discription": "\r\n                        a server-side rapid application development platform, implementing the dynamic general purpose CFML programming language. Please include CFML version, OS, and web server in questions.\r\n                    "
    },
    "camera": {
        "count": 13522,
        "discription": "\r\n                        a device that takes physical or digital photos. In the virtual world, it is used to aim at virtual objects and or move through a virtual scene.\r\n                    "
    },
    "nested": {
        "count": 13511,
        "discription": "\r\n                        relates to any of various nested entities or operations in programming.\r\n                    "
    },
    "sdk": {
        "count": 13503,
        "discription": "\r\n                        a set of development tools that allows for the creation of software for a certain hardware platform, development environment, or software package. A SDK may consist…\r\n                    "
    },
    "textview": {
        "count": 13491,
        "discription": "\r\n                        an UI element that allows users to view and/or modify the displayed text. Use this tag for programming questions related text views, and add the relevant programming language or technolog…\r\n                    "
    },
    "uicollectionview": {
        "count": 13411,
        "discription": "\r\n                        The UICollectionView class manages an ordered collection of data items and presents them using customizable layouts. Collection views provide the same general function as table views except that a col…\r\n                    "
    },
    "jestjs": {
        "count": 13407,
        "discription": "\r\n                        a JavaScript unit testing framework made by Facebook based on Jasmine and provides automated mock creation and a jsdom environment. It's often used for testing React components.\r\n                    "
    },
    "upload": {
        "count": 13367,
        "discription": "\r\n                        Upload refers to the sending of data from a local system to a remote system such as a server or another client with the intent that the remote system should store a copy of the data being transferred,…\r\n                    "
    },
    "insert": {
        "count": 13365,
        "discription": "\r\n                        an action to add information to a larger container that the information should reside within. Some examples include inserting a file into a file system, inserting a record into a database, o…\r\n                    "
    },
    "hashmap": {
        "count": 13355,
        "discription": "\r\n                        A data structure that uses a hash function to map identifying values, known as keys, to their associated values\r\n                    "
    },
    "xsd": {
        "count": 13338,
        "discription": "\r\n                        XSD generally refers to a document written in the W3C XML Schema format, containing a description of a particular type of XML document.\r\n                    "
    },
    "tabs": {
        "count": 13315,
        "discription": "\r\n                        A user interface pattern that allows for the display of multiple pages or elements with a navigation reference above, below, or to the side of the content.  On clicking the navigation reference, one e…\r\n                    "
    },
    "statistics": {
        "count": 13306,
        "discription": "\r\n                        Consider whether your question would be better asked at https://stats.stackexchange.com. Statistics is the mathematical study of using probability to infer characteristics of a population from a limit…\r\n                    "
    },
    "graphql": {
        "count": 13159,
        "discription": "\r\n                        an API technology designed to describe the complex, nested data dependencies of modern web applications. It is often considered an alternative to SOAP or REST\r\n                    "
    },
    "sas": {
        "count": 13119,
        "discription": "\r\n                        a 4GL that underpins the SAS system, a suite of products centered around data processing and statistical procedures.  For questions about code, please include your code and some da…\r\n                    "
    },
    "jquery-plugins": {
        "count": 13091,
        "discription": "\r\n                        Custom add-ons and plugins for the jQuery library. jQuery functions and features not included in the standard jQuery library.\r\n                    "
    },
    "onclick": {
        "count": 13076,
        "discription": "\r\n                        An event which occurs when user clicked an object. It is a combination of two events, that is,  \"onmousedown\" and \"onmouseup\".\r\n                    "
    },
    "floating-point": {
        "count": 12982,
        "discription": "\r\n                        approximations of real numbers that can represent larger ranges than integers but use the same amount of memory, at the cost of lower precision. If your question is about sm…\r\n                    "
    },
    "binary": {
        "count": 12963,
        "discription": "\r\n                        Binary, the base-2 numeral system, represents numbers using two symbols: 0 and 1. For compiled computer programs, use the \"executable\" tag instead.\r\n                    "
    },
    "android-ndk": {
        "count": 12949,
        "discription": "\r\n                        a companion tool to the Android SDK that lets build performance-critical portions of apps in native code or port existing libraries in C/C++ to Android. It …\r\n                    "
    },
    "sprite-kit": {
        "count": 12870,
        "discription": "\r\n                        Apple's framework for creating 2D games for iOS 7+, macOS 10.9+, tvOS 9+ and watchOS 3+. It is a 2D rendering engine combined with a physics engine. It is compatible with both Objective-C…\r\n                    "
    },
    "mongodb-query": {
        "count": 12854,
        "discription": "\r\n                        for questions related to querying and updating MongoDB collections, either through the mongo shell or using a programming language driver.\r\n                    "
    },
    "cuda": {
        "count": 12812,
        "discription": "\r\n                        CUDA (Compute Unified Device Architecture) is a parallel computing platform and programming model for NVIDIA GPUs (Graphics Processing Units). CUDA provides an interface to NVIDIA GPUs through a varie…\r\n                    "
    },
    "xml-parsing": {
        "count": 12811,
        "discription": "\r\n                        An XML parser goes through text documents containing XML trees and allows the information in the hierarchy to be used. Use this tag for problems implementing an XML parser or generated by the use of a…\r\n                    "
    },
    "pycharm": {
        "count": 12790,
        "discription": "\r\n                        an integrated development environment (IDE) for Python. It is developed by JetBrains for Windows, Mac OS X and Linux.\r\n                    "
    },
    "mocking": {
        "count": 12734,
        "discription": "\r\n                        ways to isolate code or components to ensure that unit tests run against the testable unit of code only without actually utilizing other components or dependencies of an applica…\r\n                    "
    },
    "entity-framework-core": {
        "count": 12681,
        "discription": "\r\n                        an open source multi-platform ORM developed by Microsoft. Please add a version specific tag, when applicable. Do NOT use this tag for  Entity-Framework questions. Use ent…\r\n                    "
    },
    "iterator": {
        "count": 12597,
        "discription": "\r\n                        an object-oriented programming pattern that allows traversal through a collection, agnostic of the actual implementation or object addresses in physical memory. It is one of the Gang of…\r\n                    "
    },
    "css-selectors": {
        "count": 12576,
        "discription": "\r\n                        patterns that match against elements in a document tree. In a CSS rule, they are used to define styles for elements that match the pattern.\r\n                    "
    },
    "localization": {
        "count": 12569,
        "discription": "\r\n                        the process of adapting a product or service to a particular language, culture, and desired local \"look-and-feel\".\r\n                    "
    },
    "sum": {
        "count": 12566,
        "discription": "\r\n                        The 'sum' function which returns the sum of the items in an array.\r\n                    "
    },
    "cryptography": {
        "count": 12545,
        "discription": "\r\n                        CRYPTOGRAPHY MUST BE PROGRAMMING RELATED. Cryptography covers, among other things, encryption, hashing and digital signatures. Cryptography questions not directly related to software development are b…\r\n                    "
    },
    "calendar": {
        "count": 12533,
        "discription": "\r\n                        a system of reckoning time in which the beginning, length and divisions of a year are defined. The term may refer to a software class or library for the manipulation and display of calen…\r\n                    "
    },
    "visual-studio-2017": {
        "count": 12510,
        "discription": "\r\n                        Visual Studio 2017 (aka Visual Studio \"15\", includes C++ compiler version 19.1) is a version of Microsoft's Visual Studio. Do not use this tag unless you have a specific question about this specific v…\r\n                    "
    },
    "navigation": {
        "count": 12455,
        "discription": "\r\n                        Navigation refers to the process of navigating a network of resources, and the user interface that is used to do so.\r\n                    "
    },
    "computer-vision": {
        "count": 12402,
        "discription": "\r\n                        for questions related to Computer Vision -- any aspect of software that enables computers to perceive, understand and react to their environment using cameras. For questions related to im…\r\n                    "
    },
    "linker": {
        "count": 12363,
        "discription": "\r\n                        part of the toolchain for producing executables from source code written in compiled programming languages.  It takes compiled object code in multiple files and produces a single, \"linke…\r\n                    "
    },
    "console": {
        "count": 12309,
        "discription": "\r\n                        A mechanism for interacting with a computer operating system or software by typing commands to perform specific tasks\r\n                    "
    },
    "gulp": {
        "count": 12299,
        "discription": "\r\n                        a JavaScript build system, Node.js-based task runner like Grunt. Gulp uses streams and code-over-configuration for a simpler and more intuitive build process.\r\n                    "
    },
    "header": {
        "count": 12298,
        "discription": "\r\n                        deprecated because it lacks discriminating power. Please use a more specific tag instead, e.g.: html-heading, email-header etc.\r\n                    "
    },
    "libgdx": {
        "count": 12280,
        "discription": "\r\n                        an open-source cross-platform Java game development framework based on OpenGL (ES) that works on Windows, Linux, Mac OS X, Android, iOS and WebGL enabled browsers.\r\n                    "
    },
    "uiscrollview": {
        "count": 12251,
        "discription": "\r\n                        for all questions about scroll views on iOS. Do NOT use this tag for other platforms.\r\n\r\n\r\n                    "
    },
    "drag-and-drop": {
        "count": 12248,
        "discription": "\r\n                        It allows you to  \"grab\" an object using the mouse and drag it to a different location. Drag and Drop can be done on browser based application ( web) or on  native GUI applications like android or des…\r\n                    "
    },
    "google-drive-api": {
        "count": 12227,
        "discription": "\r\n                        Questions related to integration with Google's cloud storage service or interacting with Google Drive files programmatically, via the Google Drive API, Google Drive SDK, or Google Apps Script. Usage q…\r\n                    "
    },
    "macros": {
        "count": 12190,
        "discription": "\r\n                        ***DO NOT USE for VBA / MS-Office languages. Use [vba] instead.***\r\nA macro is a rule or pattern that specifies how a certain input sequence (often a sequence of characters) should be mapped to an out…\r\n                    "
    },
    "jasmine": {
        "count": 12182,
        "discription": "\r\n                        a behavior-driven development (BDD) framework for testing JavaScript code. Jasmine has no external dependencies and does not require a DOM.\r\n                    "
    },
    "duplicates": {
        "count": 12144,
        "discription": "\r\n                        concerns detecting and/or dealing with multiple instances of items in collections.\r\n                    "
    },
    "ionic2": {
        "count": 12137,
        "discription": "\r\n                        the next generation of Ionic, the open source SDK that enables developers to build performant, high-quality mobile apps using familiar web technologies (HTML, CSS, and JavaScript).\r\n\r\nIonic…\r\n                    "
    },
    "mfc": {
        "count": 12114,
        "discription": "\r\n                        should be used for questions concerning Microsoft Foundation Class Library (MFC), a C++ framework for Windows desktop GUI application programming. You should specify a tag for the version of …\r\n                    "
    },
    "crash": {
        "count": 12078,
        "discription": "\r\n                        the result of an unrecoverable error that causes the program to stop completely.\r\n                    "
    },
    "crystal-reports": {
        "count": 12057,
        "discription": "\r\n                        a report writer that operates as a stand-alone report designer, an integrated part of Visual Studio, or part of SAP's Business Objects Enterprise suite.\r\n\r\n\r\n                    "
    },
    "textbox": {
        "count": 12039,
        "discription": "\r\n                        a graphical user interface element which allows for simple input text, usually only a single line of text.\r\n                    "
    },
    "mapreduce": {
        "count": 11904,
        "discription": "\r\n                        an algorithm for processing huge datasets on certain kinds of distributable problems using a large number of nodes\r\n                    "
    },
    "android-gradle-plugin": {
        "count": 11861,
        "discription": "\r\n                        Android's standard build system. It is used as backing-build-system by Android Studio.\r\n                    "
    },
    "ios5": {
        "count": 11843,
        "discription": "\r\n                        Apple's fifth mobile operating system, released on Oct 13, 2011. It runs on iPhone 3GS, iPhone 4, iPhone 4S, iPod Touch 3rd and 4th generation, as well as all iPad models. It was succeeded by…\r\n                    "
    },
    "json.net": {
        "count": 11805,
        "discription": "\r\n                        a popular high-performance JSON framework for .NET.\r\n                    "
    },
    "annotations": {
        "count": 11797,
        "discription": "\r\n                        used to add information to a code element which cannot be expressed by the type system.\r\n                    "
    },
    "prolog": {
        "count": 11759,
        "discription": "\r\n                        like Prologue and Epilogue. Prolog is the most commonly used logic programming language. It supports non-deterministic programming through chronological backtracking and pattern ma…\r\n                    "
    },
    "formatting": {
        "count": 11756,
        "discription": "\r\n                        The process of transforming text or data for presentation. A typical example would be the transformation of a decimal into a particular currency format with the correct number of decimal places.\r\n                    "
    },
    "anaconda": {
        "count": 11752,
        "discription": "\r\n                        an Open Data Science platform powered by Python. Use this tag for questions related to Anaconda or Anaconda Navigator. Include additional tags for specific programming languages or environ…\r\n                    "
    },
    "segmentation-fault": {
        "count": 11728,
        "discription": "\r\n                        Segmentation faults occur when accessing memory which does not belong to your process. Use this tag along with a tag indicating the language and a tag indicating the operating system. Segmentation fau…\r\n                    "
    },
    "centos": {
        "count": 11683,
        "discription": "\r\n                        CentOS (Community Enterprise Operating System) is based on the Red Hat Enterprise Linux operating system. QUESTIONS MUST BE ABOUT RUNNING PROGRAMS UNDER CENTOS. Questions about server administration m…\r\n                    "
    },
    "google-cloud-functions": {
        "count": 11664,
        "discription": "\r\n                        a lightweight, event-based, asynchronous compute solution that allows you to create small, single-purpose functions written in Node.js, Python or Go that respond to cloud eve…\r\n                    "
    },
    "com": {
        "count": 11623,
        "discription": "\r\n                        a component technology from Microsoft, featuring remoting, language independence and interface-based programming.\r\nFor questions about the COM serial port, you should u…\r\n                    "
    },
    "rabbitmq": {
        "count": 11595,
        "discription": "\r\n                        an open-source message broker originally implementing the AMQP protocol with additional messaging protocols supported via a plug-in architecture. This tag should be used with questions inv…\r\n                    "
    },
    "android-edittext": {
        "count": 11593,
        "discription": "\r\n                        the standard text entry widget in Android apps. If the user needs to enter text into an app, this is the primary way for them to do that.\r\n\r\n                    "
    },
    "operating-system": {
        "count": 11582,
        "discription": "\r\n                        a basic software whose role is to be an abstract layer between software requisitions for resources and the hardware available, manage input/output, memory allocation/deallo…\r\n                    "
    },
    "char": {
        "count": 11567,
        "discription": "\r\n                        char typically refers to a character data-type, representing letters of text.\r\n                    "
    },
    "lucene": {
        "count": 11512,
        "discription": "\r\n                        The term Lucene refers to the open source Java fulltext search engine library, but also to the entire eco-system that grew around it, including lucene.net, solr, elasticsearch and zend-search-lucene.\r\n                    "
    },
    "attributes": {
        "count": 11464,
        "discription": "\r\n                        should be used for any issues relating to a property of an object, element, or file, etc.\r\n                    "
    },
    "nosql": {
        "count": 11458,
        "discription": "\r\n                        NoSQL (sometimes expanded to \"not only SQL\") is a broad class of database management systems that differ from the classic model of the relational database management system (RDBMS) in some significant…\r\n                    "
    },
    "type-conversion": {
        "count": 11445,
        "discription": "\r\n                        the way of implicitly or explicitly changing an entity of one data type into another. This is done to take advantage of certain features of type hierarchies or type representations.\r\n                    "
    },
    "dialog": {
        "count": 11440,
        "discription": "\r\n                        A temporary window  presented to a user (usually as a small box). It interrupts program flow, overlaying the UI, for the purpose of alerting the user or requiring user input or  confirmation  about a …\r\n                    "
    },
    "keyboard": {
        "count": 11439,
        "discription": "\r\n                        to ask programming questions related to typing, keyboard hiding and more.\r\n                    "
    },
    "azure-active-directory": {
        "count": 11430,
        "discription": "\r\n                        Microsoft Azure Active Directory (Microsoft Azure AD) is a modern developer platform and IAM service that provides identity management and access control capabilities for your cloud applications. It u…\r\n                    "
    },
    "namespaces": {
        "count": 11422,
        "discription": "\r\n                        a container that provides context for identifiers, within which names are unique.\r\n                    "
    },
    "xampp": {
        "count": 11389,
        "discription": "\r\n                        a cross-platform Apache distribution bundled with MySQL, PHP and Perl.\r\n                    "
    },
    "time-series": {
        "count": 11351,
        "discription": "\r\n                        a sequence of data points with values measured at successive times (either in continuous time or at discrete time periods). Time series analysis exploits this natural temporal orderin…\r\n                    "
    },
    "continuous-integration": {
        "count": 11346,
        "discription": "\r\n                        the building and automated testing of the full software product on a frequent schedule: at least once a day, often several times a day and sometimes as often as after ev…\r\n                    "
    },
    "geolocation": {
        "count": 11341,
        "discription": "\r\n                        the identification of the real-world geographic location of an object, such as a cell phone or an Internet-connected computer terminal. Use [w3c-geolocation] for questions about the W3C…\r\n                    "
    },
    "eclipse-plugin": {
        "count": 11311,
        "discription": "\r\n                        an OSGi extensible platform for tool integration. The extensions to Eclipse are Java plug-ins. Use this tag to ask about developing Eclipse plug-ins. Note that asking for plug-in recommenda…\r\n                    "
    },
    "sql-server-2008-r2": {
        "count": 11301,
        "discription": "\r\n                        for questions specific to the 2008 R2 version of Microsoft's SQL Server.\r\n                    "
    },
    "timestamp": {
        "count": 11289,
        "discription": "\r\n                        the time at which an event is recorded by a computer system. The timestamp term may also refer to Unix Time or to the timestamp data type.\r\n                    "
    },
    "struts2": {
        "count": 11287,
        "discription": "\r\n                        an extensible framework based on servlets and implements model–view–controller (MVC) pattern in its architecture for creating enterprise-ready Java web applications.\r\n\r\n                    "
    },
    "jwt": {
        "count": 11280,
        "discription": "\r\n                        an emerging type of token-based authentication used in space-constrained environments such as HTTP Authorization headers.\r\n                    "
    },
    "asp-classic": {
        "count": 11271,
        "discription": "\r\n                        Active Server Pages (ASP), also known as Classic ASP or ASP Classic, was Microsoft's first server-side script-engine for dynamically-generated web pages. The introduction of ASP.NET led to use of the …\r\n                    "
    },
    "electron": {
        "count": 11256,
        "discription": "\r\n                        a framework created by GitHub that lets you write cross-platform desktop applications using HTML, CSS and JavaScript. Electron is based upon Node.js and Chromium.\r\n                    "
    },
    "listbox": {
        "count": 11246,
        "discription": "\r\n                        A graphical user interface element that allows the user to select one or more items from a list.\r\n                    "
    },
    "multiprocessing": {
        "count": 11176,
        "discription": "\r\n                        the use of two or more central processing units (CPUs) within a single computer system. Relevant implementation and usage details vary per operating system and programming language.…\r\n                    "
    },
    "fortran": {
        "count": 11128,
        "discription": "\r\n                        a general-purpose, procedural, imperative programming language that is especially suited for numeric computation and scientific computing. Since 2003, standard Fortran also supports object-…\r\n                    "
    },
    "garbage-collection": {
        "count": 11107,
        "discription": "\r\n                        a form of automatic memory management which attempts to reclaim garbage, or memory occupied by objects that are no longer in use by the program.\r\n                    "
    },
    "protractor": {
        "count": 11105,
        "discription": "\r\n                        an end-to-end test framework for Angular and AngularJS applications built on top of WebDriverJs.\r\n\r\nProtractor can be run as a standalone binary runner or included in your tests as a lib…\r\n                    "
    },
    "uinavigationcontroller": {
        "count": 11103,
        "discription": "\r\n                        The UINavigationController class implements a specialized iOS view controller that manages the navigation of hierarchical content.\r\n                    "
    },
    "geometry": {
        "count": 11096,
        "discription": "\r\n                        Data structures and algorithms related to geometry.  \r\n                    "
    },
    "frameworks": {
        "count": 11077,
        "discription": "\r\n                        an existing library or set of libraries that provides overarching application structure so that the developer can focus primarily on their application's implementation details instead. …\r\n                    "
    },
    "data.table": {
        "count": 11073,
        "discription": "\r\n                        an extension of data.frame built for fast in-memory data analysis. Use the dt tag for the DataTables package with Shiny (DT).\r\n\r\n                    "
    },
    "event-handling": {
        "count": 11071,
        "discription": "\r\n                        a coding style about handling messages between a source and one or more subscribers. A point listener in the source provide a way which subscribed code can consume messages raised fr…\r\n                    "
    },
    "android-emulator": {
        "count": 11055,
        "discription": "\r\n                        software which simulates the functionality of an Android device running the Android OS. Emulator allows developers to develop and test applications without the need of various r…\r\n                    "
    },
    "compiler-construction": {
        "count": 11041,
        "discription": "\r\n                         should be applied to questions concerning the programming of compilers or for questions about the detailed inner workings of compilers. DO NOT USE for questions about *us…\r\n                    "
    },
    "leaflet": {
        "count": 11030,
        "discription": "\r\n                        an open-source JavaScript library for mobile-friendly, cross-browser, interactive maps. For the R leaflet package, please use the r-leaflet tag.\r\n                    "
    },
    "db2": {
        "count": 11003,
        "discription": "\r\n                        a family of database servers developed by IBM. Supported platforms for DB2 servers are z/OS (formerly OS/390), Linux, UNIX, and Windows (referred to collectively as DB2 for LUW), and IBM i (for…\r\n                    "
    },
    "windows-7": {
        "count": 11002,
        "discription": "\r\n                        Use for questions about programming with or for Windows 7, a past release of Microsoft Windows. General software or troubleshooting questions not directly related to programming are off topic and shou…\r\n                    "
    },
    "rotation": {
        "count": 10989,
        "discription": "\r\n                        a circular movement of an object around a center (or point) of rotation.  \r\nOn a mobile device, it indicates the change of orientation.\r\n                    "
    },
    "xmlhttprequest": {
        "count": 10960,
        "discription": "\r\n                        a JavaScript object that exposes an API for making asynchronous HTTP requests from frontend code running a Web browser —  that is, for enabling the programming technique known …\r\n                    "
    },
    "uibutton": {
        "count": 10945,
        "discription": "\r\n                        a subclass of UIView for displaying buttons in iOS. It implements the target action paradigm to send events to the controller layer.\r\n                    "
    },
    "jvm": {
        "count": 10918,
        "discription": "\r\n                        The Java Virtual Machine (JVM) enables a set of computer software programs and data structures to use a virtual machine model for the execution of other computer programs and scripts. Use this tag for…\r\n                    "
    },
    "doctrine": {
        "count": 10918,
        "discription": "\r\n                        a collection of open source libraries and tools for dealing with database abstraction and Object-Relational Mapping written in PHP.\r\n                    "
    },
    "webdriver": {
        "count": 10909,
        "discription": "\r\n                        an API for controlling web browsers, imitating a real user. It's mostly used for automated tests. WebDriver has multiple language bindings and drivers (allowing to control various browser…\r\n                    "
    },
    "package": {
        "count": 10870,
        "discription": "\r\n                        Package broadly refers to two things: 1) a usable unit/component of built/compiled software, or 2) a partition of the global namespace (Java).\r\n                    "
    },
    "gitlab": {
        "count": 10869,
        "discription": "\r\n                        an Open Source Git repository manager with issue tracking and wiki as well as continuous integration features. Use this tag for programming questions related to the GitLab API or similar; qu…\r\n                    "
    },
    "jqgrid": {
        "count": 10809,
        "discription": "\r\n                        an Ajax-enabled jQuery plugin that provides a solution for representing tabular data on the web.\r\n                    "
    },
    "modal-dialog": {
        "count": 10779,
        "discription": "\r\n                        display important information to the user. These dialogs appear above all other content, blocking application flow until user input is received.\r\n                    "
    },
    "asp.net-core-mvc": {
        "count": 10777,
        "discription": "\r\n                        a lightweight presentation framework for creating dynamic websites with ASP.NET Core. It allows for creating controller based MVC sites, or view model based Razor pages. MVC includ…\r\n                    "
    },
    "windows-10": {
        "count": 10763,
        "discription": "\r\n                        The successor to Microsoft Windows 8.1 which combines features from Windows 7 and 8.1, including touch-interface and restored Start Menu.  This tag exclusively is for programming questions related to …\r\n                    "
    },
    "automated-tests": {
        "count": 10753,
        "discription": "\r\n                        the use of software to control the execution of tests, the comparison of actual outcomes to predicted outcomes, the setting up of test preconditions, and other test control and test…\r\n                    "
    },
    "format": {
        "count": 10740,
        "discription": "\r\n                        It may refer to text formatting, content format, file format, document file format, etc.\r\n                    "
    },
    "ios4": {
        "count": 10736,
        "discription": "\r\n                        The 2010-2011 version of the iPhone/iPad/iPod Touch/Apple TV operating system family, made by Apple.\r\n                    "
    },
    "uiwebview": {
        "count": 10729,
        "discription": "\r\n                        display web content from within an iOS application. Note that UIWebView is deprecated since iOS 8, it is recommended by Apple to use WKWebView instead.\r\n                    "
    },
    "delegates": {
        "count": 10727,
        "discription": "\r\n                        Delegates can refer to several concepts.  An object can rely on another (a delegate) to perform a function.  Delegation can also refer to programming language feature making use of the method lookup r…\r\n                    "
    },
    "jaxb": {
        "count": 10698,
        "discription": "\r\n                        the Java standard for working with XML as domain objects. It provides an easy mechanism for mapping Java classes to XML representations.\r\n                    "
    },
    "autolayout": {
        "count": 10697,
        "discription": "\r\n                        a constraint-based, descriptive user interface layout system for OS X and iOS.\r\n                    "
    },
    "dependencies": {
        "count": 10696,
        "discription": "\r\n                        A dependency exists between two elements if changes to the definition of one element may cause changes to the other.\r\n                    "
    },
    "react-hooks": {
        "count": 10681,
        "discription": "\r\n                        a new feature that allows developers to use state(s) and other React features without writing a class.\r\n                    "
    },
    "ldap": {
        "count": 10679,
        "discription": "\r\n                        Lightweight Directory Access Protocol (LDAP), is an application protocol for accessing and maintaining distributed directory information services over an IP network.\r\n                    "
    },
    "http-headers": {
        "count": 10643,
        "discription": "\r\n                        In the Hypertext Transfer Protocol (HTTP), HTTP header fields contain the operating parameters of an HTTP request or response. With the request or response line (first line of message), they form the …\r\n                    "
    },
    "android-viewpager": {
        "count": 10642,
        "discription": "\r\n                        A ViewGroup that manages the layout for the child views the user can swipe between.\r\n                    "
    },
    "mockito": {
        "count": 10612,
        "discription": "\r\n                        a mocking framework for Java. It is inspired by EasyMock but aims to simplify mock stubbing, verification and tooling even further.\r\n                    "
    },
    "smtp": {
        "count": 10606,
        "discription": "\r\n                        an Internet standard for electronic mail (e-mail) transmission across Internet Protocol (IP) networks.\r\n                    "
    },
    "html5-canvas": {
        "count": 10600,
        "discription": "\r\n                        an HTML element that allows for dynamic, scriptable rendering of 2D shapes, 3D shapes, bitmap images and animations in both 2D and 3D.\r\n                    "
    },
    "timezone": {
        "count": 10569,
        "discription": "\r\n                        a region on Earth that has a uniform, legally mandated standard time. It is often represented by an identifier, such as \"America/Los_Angeles\". Do not mistake an offset such as -07:00 as…\r\n                    "
    },
    "pyqt5": {
        "count": 10542,
        "discription": "\r\n                        QT5 bindings for Python programming. This allows programmer to make QT5 graphical user interfaces using Python syntax.\r\n                    "
    },
    "wso2": {
        "count": 10534,
        "discription": "\r\n                        WSO2, Open Source Java based Middleware Service provider. All WSO2 products are 100% open source and released under the Apache License Version 2.0.  \r\n                    "
    },
    "numbers": {
        "count": 10516,
        "discription": "\r\n                        a mathematical object used to count, measure and label. Questions about using numbers in variables processing, numbers processing, conversion, display, logical numerical changes, data type…\r\n                    "
    },
    "network-programming": {
        "count": 10512,
        "discription": "\r\n                        Programming associated with creating and managing networks as well as adding network connectivity to a (set of) programs.\r\n                    "
    },
    "uiimageview": {
        "count": 10497,
        "discription": "\r\n                        An image view object provides a view-based container for displaying either a single image or for animating a series of images in iOS. For animating the images, the UIImageView class provides controls …\r\n                    "
    },
    "internationalization": {
        "count": 10496,
        "discription": "\r\n                        Internationalization(i18n : representing \"internationalisation\" as \"i\" followed by 18 more \r\nletters, followed by \"n\") is the process of planning and implementing products and services\r\nso that they c…\r\n                    "
    },
    "grid": {
        "count": 10486,
        "discription": "\r\n                        ambiguous, please don't use it. For row-column layouts, use [grid-layout]. For CSS Grid layout, use [css-grid]. For the HPC setup, use [grid-computing]. For the R plotting package, use [r-…\r\n                    "
    },
    "serial-port": {
        "count": 10484,
        "discription": "\r\n                        a physical interface through which data is transferred (uni- or bidirectionally) one bit at a time. The term usually refers to the RS-232 port with a 9-pin d-sub connector that was on…\r\n                    "
    },
    "sonarqube": {
        "count": 10468,
        "discription": "\r\n                        the open source platform, to continuously inspect code quality of applications. \r\n\r\nIt allows developers to detect bugs and vulnerabilities as well as to decrease code smells or bad pract…\r\n                    "
    },
    "ionic3": {
        "count": 10465,
        "discription": "\r\n                        the newer version of Ionic, an open source SDK that enables developers to build mobile apps using standard web technologies (HTML, CSS, and JavaScript).\r\n\r\nIonic 3 is paired with Angular4 a…\r\n                    "
    },
    "integer": {
        "count": 10443,
        "discription": "\r\n                        Common datatype in many programming languages for representing a whole number. Use this tag for questions about using, storing, or manipulating integers.\r\n                    "
    },
    "cors": {
        "count": 10442,
        "discription": "\r\n                        when you see a message in the browser devtools console about CORS (Cross-Origin Resource Sharing) — e.g., your browser logged an error about Access-Control-Allow-Origin, and you want to k…\r\n                    "
    },
    "entity-framework-6": {
        "count": 10423,
        "discription": "\r\n                        For questions about the The ADO.NET Entity Framework Version 6. Add the generic [entity-framework]  tag as well if your question is not limited to the EF6 version.\r\n                    "
    },
    "material-ui": {
        "count": 10416,
        "discription": "\r\n                        React Components that Implement Google's Material Design. Please note that this tag should be used for questions regarding the Material-UI framework. Otherwise, see the tag's info for other tags to us…\r\n                    "
    },
    "arm": {
        "count": 10382,
        "discription": "\r\n                        used for questions related to the ARM (Advanced RISC Machine) family of computers; that is machines or electronics running on ARM processor cores or systems using an ARM core.\r\n                    "
    },
    "tags": {
        "count": 10377,
        "discription": "\r\n                        a marker or semantic descriptor.  Despite generic origin, this \"tag\" has become synonymous with HTML - if your question is already within this context, its use is likely unnecessary.\r\n\r\nIn a …\r\n                    "
    },
    "youtube-api": {
        "count": 10362,
        "discription": "\r\n                        The YouTube APIs and Tools enable the integration of YouTube's video content and functionality into a website, application, or device.\r\n                    "
    },
    "rubygems": {
        "count": 10361,
        "discription": "\r\n                        a package management tool for the Ruby programming language. It allows users to download and update Ruby libraries, and provides automatic dependency resolution.\r\n                    "
    },
    "windows-8": {
        "count": 10335,
        "discription": "\r\n                        The successor to Microsoft Windows 7 that focuses on a new interface style for touch-based devices and tablets.\r\n                    "
    },
    "vb6": {
        "count": 10322,
        "discription": "\r\n                        Visual Basic 6.0 (VB6) was the final COM-based version of the VB programming language and IDE, last updated in 2004. It is the predecessor to the modern VB.NET.\r\n                    "
    },
    "sql-update": {
        "count": 10292,
        "discription": "\r\n                        used to change existing rows in a table.\r\n                    "
    },
    "set": {
        "count": 10285,
        "discription": "\r\n                        a collection in which no element is repeated, which may be able to enumerate its elements according to an ordering criterion (an \"ordered set\") or retain no order (an \"unordered set\").\r\n                    "
    },
    "cocos2d-iphone": {
        "count": 10284,
        "discription": "\r\n                        Objective-C version for iOS & OS X of Cocos2d. Cocos2d is a framework for building 2D games and graphical applications.\r\n                    "
    },
    "initialization": {
        "count": 10256,
        "discription": "\r\n                        Initialization deals with the task of initializing the contents of your data structure. It's a common practice in statically-typed languages.\r\n                    "
    },
    "apache-camel": {
        "count": 10224,
        "discription": "\r\n                        an open source integration framework that focuses on quick and easy integration of  systems consuming or producing data.\r\n                    "
    }
}